[
    {
        "index": 11,
        "question": "The figure below shows an apparatus for the determination of $C_{p} / C_{v}$ for a gas, according to the method of Clement and Desormes. A bottle $G$, of reasonable capacity (say a few litres), is fitted with a tap $H$, and a manometer $M$. The difference in pressure between the inside and the outside can thus be determined by observation of the difference $h$ in heights of the two columns in the manometer. The bottle is filled with the gas to be investigated, at a very slight excess pressure over the outside atmospheric pressure. The bottle is left in peace (with the tap closed) until the temperature of the gas in the bottle is the same as the outside temperature in the room. Let the reading of the manometer be $h_{i}$. The tap $H$ is then opened for a very short time, just sufficient for the internal pressure to become equal to the atmospheric pressure (in which case the manometer reads $h=0$ ). With the tap closed the bottle is left in peace for a while, until the inside temperature has become equal to the outside temperature. Let the final reading of the manometer be $h$. From the values of $h_{i}$ and $h_{f}$ it is possible to find $C_{p} / C_{v}$. Suppose that the gas in question is oxygen. What is your theoretical prediction for $C_{p} / C_{v}$ at $20^{\\text{C}}$, within the framework of statistical mechanics?",
        "subject": "TSM",
        "image_path": [
            "images/11_0.png"
        ],
        "img_category": "thermodynamics",
        "vision_relevance": "essential",
        "language": "English",
        "level": 7,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA vessel $G$ is sealed with a stopper $H$ connected to a manometer $M$ via tubing; the manometer contains a fluid column of height $h$, indicating a pressure difference relative to atmospheric pressure."
    },
    {
        "index": 36,
        "question": "A car is traveling in the $x$-direction and maintains constant horizontal speed $v$. The car goes over a bump whose shape is described by $y_{0}=A[1-\\cos (\\pi x / l)]$ for $0 \\leq x \\leq 2 l ; y_{0}=0$ otherwise. Determine the motion of the center of mass of the car while passing over the bump. Represent the car as a mass $m$ attached to a massless spring of relaxed length $l_{0}$ and spring constant $k$. Ignore friction and assume that the spring is vertical at all times.",
        "subject": "CM",
        "image_path": [
            "images/36_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "optional",
        "language": "English",
        "level": 7,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA block of mass $m$ is attached to a vertical spring at point $O$ on the $y$-axis and is launched horizontally along the $x$-axis with velocity $v$ from the spring’s equilibrium position. The block moves over a smooth, hump-shaped surface, reaching a height before descending, with its position indicated at $2l$ along the $x$-axis. Both the initial velocity vector $v$ and the spring force are depicted in the positive $x$-direction."
    },
    {
        "index": 41,
        "question": "A thin ring of mass $M$ and radius $r$ lies flat on a frictionless table. It is constrained by two extended identical springs with relaxed length $l_{0}$ ($l_{0} \\gg r$) and spring constant $k$ as shown in Fig. 1.55. What are the normal modes of small oscillations and their frequencies?",
        "subject": "CM",
        "image_path": [
            "images/41_0.png"
        ],
        "img_category": "spring_force",
        "vision_relevance": "essential",
        "language": "English",
        "level": 7,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA ring of radius $r$ is connected between two identical horizontal springs with spring constants $k$, each attached to fixed walls; the unstretched lengths from each wall to the ring are $2\\ell_0$, and the ring has a distance $2r$ between the spring endpoints. No external forces or other vectors are shown."
    },
    {
        "index": 45,
        "question": "In the circuit shown in Fig. 3.23, the resistance of $L$ is negligible and initially the switch is open and the current is zero. Find the quantity of heat dissipated in the resistance $R_{2}$ when the switch is closed and remains closed for a long time. (Notice the circuit diagram and the list of values for $V, R_{1}, R_{2}$, and $L_{0}$).",
        "subject": "EM",
        "image_path": [
            "images/45_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 7,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nSchematic diagram of an electric circuit with a voltage source $V = 100~\\text{V}$ connected in series to a resistor $R_1 = 10~\\Omega$, followed by a parallel branch comprising a resistor $R_2 = 100~\\Omega$ and an inductor $L = 10~\\text{H}$ in series; all components are labeled with their values."
    },
    {
        "index": 70,
        "question": "Refer to Fig. 3.67. When this monostable circuit is triggered how long will $Q_{2}$ be off?",
        "subject": "CM",
        "image_path": [
            "images/70_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 7,
        "sig_figs": "1",
        "caption": "IMAGE 1:\nElectronic circuit diagram showing two NPN transistors $Q_1$ and $Q_2$ arranged in a bistable multivibrator configuration: $Q_1$ and $Q_2$ have collector resistors of $5\\,\\text{K}\\Omega$ each connected to $-20\\ \\text{V}$, a coupling capacitor $C$ between the base of $Q_2$ and the collector of $Q_1$, a $100\\,\\text{K}\\Omega$ resistor from the collector of $Q_2$ to the base of $Q_1$, a voltage divider bias made by $50\\,\\text{K}\\Omega$ and $25\\,\\text{K}\\Omega$ resistors connected from $+6\\ \\text{V}$ to ground supplying the base of $Q_1$. All ground connections and voltage sources ($+6$\\ V, $-20$\\ V) are indicated."
    },
    {
        "index": 125,
        "question": "As shown in Fig. 3.26, the switch has been in position A for a long time. At $t=0$ it is suddenly moved to position B. Immediately after contact with B: Between $t=0$ and $t=0.1 \\mathrm{~s}$, what total energy is dissipated in $R$ ?",
        "subject": "EM",
        "image_path": [
            "images/125_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "1",
        "caption": "IMAGE 1:\nA circuit diagram shows a 1 V voltage source in series with a 1 Ω resistor, connected at point A; a switch S can connect A to the rest of the circuit. When S is closed, current flows through an inductor labeled $L = 1\\,\\mathrm{H}$ (indicated by a coil, with counterclockwise arrow marking current direction), then through a resistor labeled $R = 10^4\\,\\Omega$, reaching point B which is grounded."
    },
    {
        "index": 131,
        "question": "Consider the interference pattern from the three slits illustrated (Fig. 2.3). Assume the openings of the individual slits are the same ($\\leqslant \\frac{\\lambda}{2}$). At what value of $\\theta$ is the first principal maximum? (i.e., the wavelets from all three slits are in phase).",
        "subject": "OPT",
        "image_path": [
            "images/131_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo vertical slits in an opaque barrier are separated by a distance labeled $d$, with the lower slit offset by an additional $(3/2)d$ relative to the upper edge; a ray emerges from each slit and travels to the right at an angle $\\theta$ above the horizontal, with $\\theta$ marked between the horizontal reference line and the upper ray."
    },
    {
        "index": 140,
        "question": "A disk of mass $M$ and radius $R$ slides without friction on a horizontal surface. Another disk of mass $m$ and radius $r$ is pinned through its center to a point off the center of the first disk by a distance $b$, so that it can rotate without friction on the first disk as shown in Fig. 2.2. Describe the motion and identify its constants.",
        "subject": "CM",
        "image_path": [
            "images/140_0.png",
            "images/140_1.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA large circle centered at point $C$ rotates counterclockwise in the $xy$-plane. Inside, a smaller circle also rotates counterclockwise around its own center $C'$; the center $C'$ traces the circumference of the large circle, maintaining distance $b$ from $C$. The angle $\\theta$ is measured from the $x$-axis to the radius connecting $C$ and $C'$; an arc arrow indicates the rotation direction for both circles. Coordinate axes $Oxy$ are shown."
    },
    {
        "index": 142,
        "question": "For the circuit shown in Fig. 3.35, the coupling coefficient of mutual inductance for the two coils $L_{1}$ and $L_{2}$ is unity. What is the phase angle of the input current with respect to the driving voltage as the oscillator frequency approaches the resonant frequency of the secondary circuit?",
        "subject": "EM",
        "image_path": [
            "images/142_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nSchematic of two magnetically coupled circuits: the left circuit contains an AC voltage source $V=V_0\\cos\\omega t$ in series with a resistor $R$ and an inductor $L_1$ (carrying current $i_1$); the right circuit consists of an inductor $L_2$ in series with a capacitor $C$ (carrying current $i_2$). The inductors $L_1$ and $L_2$ are positioned to indicate mutual inductance. Directions of currents $i_1$ and $i_2$ are indicated by arrows in each loop."
    },
    {
        "index": 166,
        "question": "A beam of neutrons passes through a hydrogen target (density $4 \\times$ $10^{22}$ atom $/ \\mathrm{cm}^{3}$ ) and is detected in a counter C as shown in Fig. 4.10. For equal incident beam flux, $5.0 \\times 10^{5}$ counts are recorded in C with the target empty, and $4.6 \\times 10^{5}$ with the target full of hydrogen. Estimate the total $n-p$ scattering cross section, and its statistical error.",
        "subject": "AMONP",
        "image_path": [
            "images/166_0.png"
        ],
        "img_category": "atomic_physics",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA rectangular bar is drawn horizontally inside a box, with the left end labeled $N$ and the right end labeled $C$. The length between $N$ and $C$ is indicated as $1\\,\\mathrm{metre}$ by a double-headed arrow above the bar."
    },
    {
        "index": 188,
        "question": "Consider the situation shown in Fig. 4.28 where a perfectly conducting thin wire connects two small metallic balls. Suppose the charge density is given by $\\rho(\\mathbf{x}, t)=[\\delta(z-a)-\\delta(z+a)]\\delta(x)\\delta(y) Q\\cos(\\omega_{0}t)$. The current flows between the metallic balls through the thin wire. $a$, $Q$, and $\\omega_{0}$ are constants. When is the dipole approximation valid?",
        "subject": "CM",
        "image_path": [
            "images/188_0.png"
        ],
        "img_category": "charge_distribution",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo point charges, $+Q$ and $-Q$, are located on the $z$-axis at positions $z = +a$ and $z = -a$, respectively; the coordinate axes $x$, $y$, and $z$ are indicated with arrows pointing in their respective positive directions."
    },
    {
        "index": 200,
        "question": "Metallic diffraction grating.\\nPurcell (Phys. Rev. 92, 1069) has shown that electromagnetic radiation is emitted from a metallic diffraction grating when a beam of charged particles passes near and parallel to the surface of the grating.\\n\\nThe velocity of the charged particles is $v$ and the grating spacing is $d$. Consider only the light emitted in the plane perpendicular to the grating and containing the particle trajectory. Suppose the metallic grating is replaced by a transmission grating, e.g., a piece of glass with grooves ruled onto it, still $d$ apart. In what way, if any, will this change the emitted radiation?\\nExplain qualitatively.",
        "subject": "OPT",
        "image_path": [
            "images/200_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nCaption:\n\n(a) Diagram shows a grating with slits spaced by distance $d$ aligned parallel to the $y$-axis in the $xy$-plane, with particle trajectory indicated as a rightward arrow along the $x$-axis; axes $x$ and $y$ are labeled from origin $O$.\n\n(b) Diagram depicts a set of parallel lines in the $xz$-plane suggesting planes or slits, with trajectory lines originating from $O$ making an angle $\\theta$ with the $x$-axis in the $xz$-plane; axes $x$, $y$, and $z$ are labeled from $O$."
    },
    {
        "index": 202,
        "question": "A camera (focal length 50 cm , apert ure diameter $D$ ), sensitive to visible light, is sharply focused on the stars; it is then used without refocusing for an object at a distance of 100 meters. Roughly, what aperture $D$ will give the best resolution for this object? Give $D$ in cm .",
        "subject": "OPT",
        "image_path": [
            "images/202_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA convex lens with diameter $D$ focuses parallel incoming rays to form a spot of diameter $d$ at the focal plane; the focal length is labeled $f$, and the distance from the lens to the final screen or image plane is labeled $v$. The optical axis runs horizontally through the system."
    },
    {
        "index": 209,
        "question": "Two infinite parallel wires separated by a distance $d$ carry equal currents $I$ in opposite directions, with $I$ increasing at the rate $\\frac{dI}{dt}$. A square loop of wire of length $d$ on a side lies in the plane of the wires at a distance $d$ from one of the parallel wires, as illustrated in Fig. 2.30. Is the induced current clockwise or counterclockwise? Justify your answer.",
        "subject": "EM",
        "image_path": [
            "images/209_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo parallel, infinitely long straight wires labeled $1$ and $2$ carry currents $I$ to the right; they are separated vertically by a distance $d$. A square loop of side length $d$ is positioned such that its top and left sides are each at distance $d$ from wire $2$; the right and bottom sides of the loop lie adjacent to the depicted guide lines. All current directions are indicated with arrows pointing right."
    },
    {
        "index": 213,
        "question": "A particle of mass $m$ can slide without friction on the inside of a small tube bent in the form of a circle of radius $a$. The tube rotates about a vertical diameter at a constant rate of $\\omega\\,\\mathrm{rad}/\\mathrm{sec}$ as shown in Fig. 1.79. Write the differential equation of motion. (SUNY, Buffalo)",
        "subject": "CM",
        "image_path": [
            "images/213_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "optional",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA small mass is located inside a smooth circular ring of radius $a$, which is oriented vertically and fixed at its center. The mass is at an angle $\\theta$ from the vertical within the ring. Forces labeled $mg$ (vertically downward) and $N$ (normal to the ring at the mass’s location) act on the mass, as shown by arrows. The system rotates with angular velocity $\\omega$ about a vertical axis passing through the center of the ring. Gravitational acceleration $\\vec{g}$ is indicated vertically downward."
    },
    {
        "index": 214,
        "question": "A heavy star of mass $M$ and radius $R$ moves with velocity $\\mathbf{V}$ through a very dilute gas of mass density $\\rho$. It pulls particles toward itself by its gravitational field and captures all of the atoms that strike its surface. Find the drag force on the star with the approximation that the thermal velocities of the atoms are negligible relative to $|\\mathbf{V}|$ and the interactions of atoms with each other can be neglected. (CUSPEA)",
        "subject": "ACG",
        "image_path": [
            "images/214_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA circular object of radius $R$ is positioned in an ideal fluid flow, with streamlines shown approaching from the right. The uniform flow has velocity vector $\\vec{v}$ directed leftward, and the separation distance between two adjacent streamlines is labeled as $b$."
    },
    {
        "index": 215,
        "question": "Two non-relativistic particles of equal energy and equal mass collide almost head-on. In a coordinate frame (the center of mass frame) moving with velocity $\\mathbf{V}$, the particles appear to collide head-on. Find $\\mathbf{V}$, the velocity of the center of mass frame.",
        "subject": "CM",
        "image_path": [
            "images/215_0.png"
        ],
        "img_category": "linear_motion",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo particles of mass $m_1$ and $m_2$ are shown at the origin $O$, with $m_1$ moving along the negative $x$-axis with velocity $\\vec{u}$ and $m_2$ moving at an angle $\\theta_0$ above the positive $x$-axis with velocity $\\vec{u}$; axes $x$ and $y$ are labeled, and all velocity vectors are indicated with arrows."
    },
    {
        "index": 221,
        "question": "Cylinder C (mass 10.0 kg and radius 0.070 m) rolls without slipping on hill H as shown in Fig. 1.121. The string does not stretch and is wrapped around the cylinder C. What are the magnitude and direction of the force of static friction at the contact point P?",
        "subject": "CM",
        "image_path": [
            "images/221_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA cylinder labeled $C$ of mass $m$ rests on an inclined plane at $30^\\circ$ to the horizontal, with its center connected via a rope over a pulley to a $2.0\\, \\mathrm{kg}$ hanging mass; the force $\\vec{F}$ acts tangentially from the rope on both $C$ and the $2.0\\, \\mathrm{kg}$ mass. The center-of-mass point $P$ of the cylinder and distance $H$ (vertical height of the inclined ramp) are indicated. The cylinder experiences gravitational force $mg$ downwards, and $x$ and $y$ axes are shown with $x$ parallel to the incline and $y$ normal to the incline. The angular acceleration $\\ddot\\theta$ of the cylinder is marked."
    },
    {
        "index": 225,
        "question": "A rigid square massless frame contains 4 disks rotating as shown in Fig. 1.183. Each disk has mass $m$, moment of inertia $I_{0}$, and rotational velocity $\\omega_{0}$. The frame is horizontal and pivots freely about a support at one corner. What is the precession rate? (MIT)",
        "subject": "CM",
        "image_path": [
            "images/225_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA rectangular wire frame with four pulleys is shown resting on a horizontal surface. One corner is fixed at point $O$; the opposite corner is labeled $C$, located a distance $D$ from $O$. A downward force labeled $4mg$ acts at point $C$."
    },
    {
        "index": 234,
        "question": "In Fig. 2.31 two conductors of infinite length carry a current $I$. They are parallel and separated by a distance $2 a$. A circular conducting ring of radius $a$ in the plane of the parallel wires lies between the two straight conductors and is insulated from them. Find the coefficient of mutual inductance between the circular conductor and the two straight conductors.",
        "subject": "EM",
        "image_path": [
            "images/234_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA circular wire loop of radius $a$ is centered between two long, straight, parallel wires separated by a distance $2a$; both wires carry current $I$ out of the page, and a vertical distance $y$ is marked from the loop's center upward; the lower wire is positioned a distance $l$ below the circle."
    },
    {
        "index": 236,
        "question": "In the circuit shown in Fig. 3.21, the capacitors are initially charged to a voltage $V_{0}$. At $t=0$ the switch is closed. Derive an expression for the voltage at point $A$ at a later time $t$.",
        "subject": "EM",
        "image_path": [
            "images/236_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nThe diagram shows an electric circuit with two identical resistors labeled $R$, two identical capacitors labeled $C$, and a voltage source labeled $V_2$. The circuit includes currents $i_1$, $i_2$, and $i_3$ with arrows indicating their directions; $i_1$ flows rightward through the first resistor and capacitor, $i_2$ flows rightward through the second resistor and capacitor, and $i_3$ flows downward from node $V_1$. The node between the first capacitor and the second resistor is labeled $V_1$, and point $A$ is at the top right before the second capacitor. All voltage polarities and current directions are marked."
    },
    {
        "index": 240,
        "question": "A semi-infinite electrical network is formed from condensers $C$ and inductances $L$, as shown in Fig. 3.84. The network starts from the left at the terminals $A$ and $B$; it continues infinitely to the right. An alternating voltage $V_{0}\\cos\\omega t$ is applied across the terminals $A$ and $B$ and this causes a current to flow through the network. Compute the power $P$, averaged over a cycle, that is fed thereby into the circuit. The answer will be quantitatively different in the regimes $\\omega>\\omega_{0}, \\omega<\\omega_{0}$, where $\\omega_{0}$ is a certain critical frequency formed out of $C$ and $L$.",
        "subject": "EM",
        "image_path": [
            "images/240_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nCircuit diagram with two terminals labeled $A$ and $B$; multiple capacitors labeled $C$ are connected in series along the top wire between $A$ and $B$, while each capacitor’s junction connects to a parallel inductor labeled $L$ that connects vertically down to the bottom wire connecting back to $B$. The arrangement repeats in a periodic network (ladder structure), as indicated by the ellipsis."
    },
    {
        "index": 246,
        "question": "A point source $Q$ emits coherent light isotropically at two frequencies $w$ and $w+ \\Delta w$ with equal power I joules/sec at each frequency. Two detectors $A$ and $B$ each with a (small) sensitive area $s$, capable of responding to individual photons are located at distances $l_{A}$ and $l_{B}$ from $Q$ as shown in Fig. 8.4. In the following take $\\Delta \\omega/\\omega\\ll1$ and assume the experiment is carried out in vacuum. If now the output pulses from $A$ and $B$ are put into a coincidence circuit of resolving time $\\tau$, what is the time-averaged coincidence counting rate? Assume that $\\tau\\ll 1/\\Delta \\omega$ and recall that a coincidence circuit will produce an output pulse if the two input pulses arrive within a time $\\tau$ of each other.",
        "subject": "OPT",
        "image_path": [
            "images/246_0.png"
        ],
        "img_category": "quantum_mechanics",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA point $Q$ is connected by dashed lines to two points, $A$ and $B$, with respective distances labeled $l_A$ and $l_B$. Both $A$ and $B$ are associated with rectangular blocks oriented perpendicular to the dashed lines, indicating that $A$ and $B$ lie on lines or surfaces perpendicular to $QA$ and $QB$ at those points."
    },
    {
        "index": 251,
        "question": "The $\\gamma$-ray total nuclear cross section $\\sigma_{total}$(excluding $e^+e^-$ pair pro-duction) on neodymium 142 is given in the Figure. Using a simple model of the nucleus as A particles bound in an harmonic oscillator potential, estimate the resonance energy as a function of A. Does this agree with the observed value in the figure for A=142?",
        "subject": "AMONP",
        "image_path": [
            "images/251_0.png"
        ],
        "img_category": "coordinate_system",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nPlot of the cross-section $\\sigma$ (in $\\mathrm{fm}^2$) versus photon energy $E_\\gamma$ (in MeV) for ${}^{142}$Nd, showing a single-peaked curve spanning $8 \\leq E_\\gamma \\leq 22$ MeV and $0 \\leq \\sigma \\leq 40\\, \\mathrm{fm}^2$."
    },
    {
        "index": 269,
        "question": "A heavy symmetrical top with one point fixed is precessing at a steady angular velocity $\\Omega$ about the vertical axis $z$. What is the minimum spin $\\omega^{\\prime}$ about its symmetrical axis $z^{\\prime}$ (where $z^{\\prime}$ is inclined at an angle $\\theta$ with respect to the $z$-axis)? The top has mass $m$ and its center of gravity is at a distance $h$ from the fixed point. Use the coordinate systems indicated in Fig. 1.193, with the axes $z, z^{\\prime}, x$ and $x^{\\prime}$ in the same plane at the time under consideration and assume $I_{1}=I_{2}$.",
        "subject": "CM",
        "image_path": [
            "images/269_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nDiagram shows two coordinate systems, $(x, z)$ and $(x', z')$, sharing the origin $O$, with $z$ and $z'$ axes forming an angle $\\theta$. The $z$-axis is associated with angular velocity vector $\\vec{\\Omega}$, while the $z'$-axis is associated with angular velocity vector $\\vec{\\omega}'$; both vectors are indicated as rotating about their respective axes. Arrows mark the positive direction of each vector."
    },
    {
        "index": 283,
        "question": "Consider the system of particles $m_{1}=m_{2}$ connected by a rope of length $l$ with $m_{2}$ constrained to stay on the surface of an upright cone of half‐angle $\\alpha$ and $m_{1}$ hanging freely inside the cone, the rope passing through a hole at the top of the cone. Neglect friction. Write the Hamiltonian for the system.",
        "subject": "CM",
        "image_path": [
            "images/283_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA three-dimensional coordinate system ($x$, $y$, $z$) is shown, with two point masses $m_1$ and $m_2$ located on the surface of a cone whose apex coincides with the origin; the semi-vertical angle of the cone is labeled $\\alpha$, and both masses lie along the generatrix, as indicated."
    },
    {
        "index": 312,
        "question": "Any linear dc network (a load $R$ is connected between the two arbitrary points A and B of the network) is equivalent to a series circuit consisting of a battery of emf $V$ and a resistance $r$, as shown in Fig. 3.4. Calculate $V$ and $r$ of the circuit in Fig. 3.7. (Hint: Use mathematical induction)",
        "subject": "CM",
        "image_path": [
            "images/312_0.png",
            "images/312_1.png",
            "images/312_2.png",
            "images/312_3.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA closed electric circuit consisting of a cell with emf $V$, an internal resistor of resistance $r$, and an external resistor of resistance $R$ connected between points $A$ and $B$. The path of current flow is indicated through the series arrangement: cell $\\to$ $r$ $\\to$ ($R$ between $A$ and $B$) $\\to$ back to cell."
    },
    {
        "index": 321,
        "question": "In the circuit shown in Fig. 3.52, the capacitor has circular plates of radius $r_{0}$ separated by a distance $d$. Between the plates there is a vacuum. At $t=0$, when there is a charge $Q_{0}$ on the capacitor, the switch is closed. Find the magnetic field between the plates for $t>0$. You may use idealizations and approximations similar to those in (b).",
        "subject": "EM",
        "image_path": [
            "images/321_0.png",
            "images/321_1.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA rectangular electric circuit consisting of a resistor labeled $R$, a uniform rod of length $l$ and resistance $r_0$ oriented vertically, and a connecting wire; the rod is shown with a separation $d$ from a parallel conducting track, and the entire upper assembly can move horizontally as indicated by the arrow labeled $x$."
    },
    {
        "index": 338,
        "question": "A waveguide is formed by two infinite parallel perfectly conducting planes separated by a distance $a$. The gap between the planes is filled with a gas whose index of refraction is $n$ (this is taken to be frequency independent). Any electromagnetic disturbance (independent of $y$) must be expressible as a superposition of the waveguide modes considered in part (a). What is the mode corresponding to the principal frequency of the Čerenkov spectrum considered in part (b)?",
        "subject": "EM",
        "image_path": [
            "images/338_0.png",
            "images/338_1.png"
        ],
        "img_category": "wave_motion",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo parallel plates are shown, separated by distance $a$. A three-dimensional coordinate system with axes labeled $x$, $y$, and $z$ is depicted near the plates, with explicit directions given for each axis."
    },
    {
        "index": 341,
        "question": "A particle of charge $q$ moving in one dimension is initially bound to a delta function potential at the origin. From time $t=0$ to $t=\\tau$ it is exposed to a constant electric field $\\varepsilon_{0}$ in the $x$ direction as shown in Fig. 6.15. The object of this problem is to find the probability that for $t>\\tau$ the particle will be found in an unbound state with energy between $E_{k}$ and $E_{k}+dE_{k}$. The probability of a transition between an initially occupied state $|I\\rangle$ and a final state $|F\\rangle$ due to a weak perturbation Hamiltonian $\\hat{H}_{1}(t)$ is given by\\n$$\\nP_{I\\rightarrow F}(t)=\\frac{1}{\\hbar^{2}}\\left|\\int_{-\\infty}^{t}\\langle F|\\hat{H}_{1}(t')|I\\rangle e^{i\\omega_{FI}t'}dt'\\right|^{2},\\n$$\\nwhere $\\omega_{FI}=\\frac{E_{F}-E_{I}}{\\hbar}$. Find an expression for the probability $P(E_{k})\\,dE_{k}$ that the particle will be in an unbound state with energy between $E_{k}$ and $E_{k}+dE_{k}$ for $t>\\tau$.",
        "subject": "QMIT",
        "image_path": [
            "images/341_0.png"
        ],
        "img_category": "quantum_mechanics",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA time graph showing $\\varepsilon_x(t)$ versus $t$: $\\varepsilon_x(t)$ remains constant at $\\varepsilon_0$ from $t=0$ to $t=\\tau$ and is zero elsewhere; axes are labeled $t$ (horizontal) and $\\varepsilon_x(t)$ (vertical), with the constant value $\\varepsilon_0$ and the time $\\tau$ indicated."
    },
    {
        "index": 344,
        "question": "The elasticity of a rubber band can be described in terms of a onedimensional model of polymer involving $N$ molecules linked together end-to-end. The angle between successive links is equally likely to be $0^{\\circ}$ or $180^{\\circ}$. Find the relationship between the force and the length, without using the condition in (c), i.e., for any possible value of $L$, but $N \\gg 1$.",
        "subject": "TSM",
        "image_path": [
            "images/344_0.png"
        ],
        "img_category": "spring_force",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nDiagram showing $N$ molecules moving within a one-dimensional region of length $L$, where each step between molecular positions has length $d$; arrows indicate the direction of individual molecular displacements, with most directed to the right and some to the left, consistent with the labeled displacement $d$."
    },
    {
        "index": 352,
        "question": "The schematic drawing below (Fig. 2.42) shows the experimental set up for the production of a well-collimated beam of sodium atoms for an atomic beam experiment. Sodium is present in the oven $S$, which is kept at the temperature $T=550 \\text{ K}$. At this temperature the vapor pressure of sodium is $p=6 \\times 10^{-3}$ torr. The sodium atoms emerge through a slit in the wall of the oven. The hole is rectangular, with dimensions 10 mm $\\times 0.1 \\text{ mm}$. The collimator $C$ has a hole of identical size and shape, and the sodium atoms which pass through $C$ thus constitute the atomic beam under consideration. The atomic mass of sodium is 23. The distance $d$ in the figure is 10 cm. The region in which the beam propagates must, of course, be a reasonably good vacuum. Estimate (and give answer in torr) just how good the vacuum ought to be if the beam is to remain collimated for at least 1 meter. (1 torr $=1 \\text{ mmHg}$).",
        "subject": "TSM",
        "image_path": [
            "images/352_0.png"
        ],
        "img_category": "atomic_physics",
        "vision_relevance": "optional",
        "language": "English",
        "level": 8,
        "sig_figs": "1",
        "caption": "IMAGE 1:\nA sodium source labeled \"Na\" is enclosed in box $S$, emitting a beam shown as a dashed line directed horizontally to the right toward point $C$; distance between $S$ and $C$ is marked as $d$. The beam passes through $C$ and continues rightward, indicated by an arrow labeled \"to experiment.\""
    },
    {
        "index": 353,
        "question": "Consider a one-dimensional solid of length \\(L=N a\\) made up of \\(N\\) diatomic molecules, the interatomic spacing within a molecule is \\(b\\left(b<\\frac{a}{2}\\right)\\). The centers of adjacent molecules are a distance \\(a\\) apart. We represent the potential energy as a sum of delta functions centered on each atom:\\n\\[\\nV=-A \\sum_{n=0}^{N-1}\\left[\\delta\\left(x-n a+\\frac{b}{2}\\right)+\\delta\\left(x-n a-\\frac{b}{2}\\right)\\right]\\n\\]\\nwith \\(A\\) a positive quantity and \\(n=0,1,2, \\ldots, N-1\\). The potential is shown in Fig. 1.18. Expressing the potential as a Fourier series\\n\\[\\nV=\\sum_{q} V_{q} e^{i q x}\\n\\]\\nfind the allowed values of \\(q\\) and the coefficients \\(V_{q}\\).",
        "subject": "AMONP",
        "image_path": [
            "images/353_0.png"
        ],
        "img_category": "linear_motion",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nDiagram shows a one-dimensional periodic potential well array along the $x$-axis, with potential wells of width $b$ spaced at intervals $a$; positions are labeled at $x=0$, $x=a$, and $x=(N-1)a$ for a total of $N$ wells."
    },
    {
        "index": 371,
        "question": "Suppose a search for solar neutrinos is to be mounted using a large sample of lithium enriched in the isotope $ {}_{3}^{7} \\text{Li}$. Detection depends on production, separation, and detection of the electron-capturing isotope $ {}_{4}^{7} \\text{Be}$ with a half-life of 53 days. The low-lying levels of these two nuclei are shown below in Fig. 2.28. The atomic mass of $ {}_{4}^{7} \\text{Be}$ in its ground state lies 0.86 MeV above the atomic mass of $ {}_{3}^{7} \\text{Li}$ in its ground state. To calibrate this detector, a point source emitting $10^{17}$ monochromatic neutrinos/sec with energy 1.5 MeV is placed in the center of a one metric ton sphere of lithium-7. Estimate the total equilibrium disintegration rate of the beryllium-7, given $$\\begin{array}{l} G_{V}=1.42 \\times 10^{-49} \\mathrm{erg} \\mathrm{~cm};  G_{A}=1.60 \\times 10^{-49} \\mathrm{erg} \\mathrm{~cm}^{3}; \\rho_{\\mathrm{Li}}=0.53 \\mathrm{gm} / \\mathrm{cm}^{3}\\end{array}$$.",
        "subject": "AMONP",
        "image_path": [
            "images/371_0.png"
        ],
        "img_category": "atomic_physics",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nEnergy level diagram showing the states of $_3^7$Li and $_4^7$Be nuclei, with each horizontal line labeled by its excitation energy (in MeV) and spin/parity $\\left( \\frac{7}{2}^-,\\ \\frac{1}{2}^-,\\ \\frac{3}{2}^- \\right)$. States for $^7$Li (left: 0 MeV, 0.48 MeV, 4.63 MeV) and $^7$Be (right: 0 MeV, 0.86 MeV) are aligned, showing corresponding levels. No explicit transitions, arrows, or external fields are depicted; all lines are horizontal for the energy levels, with some dashed."
    },
    {
        "index": 376,
        "question": "High energy neutrino beams at Fermilab are made by first forming a monoenergetic $\n\\pi^{+}$(or $K^{+}$) beam and then allowing the pions to decay by \n$$\n\\pi^{+} \\rightarrow \\mu^{+}+\nu\n$$\n\nRecall that the mass of the pion is $140 \\mathrm{MeV} / c^{2}$ and the mass of the muon is $106 \\mathrm{MeV} / c^{2}$. In the laboratory frame, the energy of the decay neutrino depends on the decay angle $\\theta$ (see Fig. 4.6). Suppose the $\\pi^{+}$beam has an energy $200 \\mathrm{GeV} / c^{2}$. Find the angle $\\theta$ at which the neutrino's energy has fallen to half of its maximum energy.",
        "subject": "AMONP",
        "image_path": [
            "images/376_0.png"
        ],
        "img_category": "atomic_physics",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA $\\pi^+$ meson is shown decaying into a $\\mu^+$ and a neutrino $\\nu$ at a common vertex; the $\\mu^+$ and $\\nu$ move apart at an angle $\\theta$ between their trajectories, with the neutrino directed toward a labeled neutrino detector."
    },
    {
        "index": 381,
        "question": "A 35 mm camera lens of focal length 50 mm is made into a telephoto lens by placing a negative lens between it and the film, as shown (Fig. 1.43). $\\mathrm{L}_{1}=$ camera lens, $f_{1}=50 \\mathrm{~mm} ; \\mathrm{L}_{2}=$ negative lens, $f_{2}=-100 \\mathrm{~mm}$. What is the magnification produced by the lens combination?",
        "subject": "OPT",
        "image_path": [
            "images/381_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nThe diagram shows a convex lens $L_1$ and a concave lens $L_2$ aligned along a common principal axis, with $L_2$ positioned 20 mm to the right of $L_1$; a film is located at a distance $x$ to the right of $L_2$. No vectors are depicted, and the spatial arrangement indicates light travels from left (through $L_1$), then $L_2$, finally reaching the film."
    },
    {
        "index": 384,
        "question": "A two-slit diffraction pattern is produced by the arrangement shown in Fig. 2.9. A discharge tube produces light of wavelength $\\lambda$ which passes through a small slit $S$ immediately in front of the tube. The centers of the two slits of width $w$ are at distance $D$ apart. How large may $w$ be before the interference pattern is washed out?",
        "subject": "OPT",
        "image_path": [
            "images/384_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nDiagram shows a discharge tube emitting rays passing through two parallel slits each of width $w$ and separated by distance $D$; various path lengths and distances are labeled: $x$ (from discharge tube to slits), $L$ (from slits to point $P$ on the screen), $y$ (slit positions), path difference at angle $\\theta$, and $l$ (vertical displacement at the screen); geometrical rays are shown meeting at point $P$, with $\\theta$ marked as the angle relative to the central axis."
    },
    {
        "index": 395,
        "question": "A beam of light, with $\\lambda=5000 \\AA$, traveling in the $z$-direction is polarised at $45^{\\circ}$ to the $x$-direction. It passes through a Kerr cell, i.e., a substance such that $n_{x}-n_{y}=K E^{2}$, where $n_{x}$ and $n_{y}$ are the refractive indices for light polarized in the $x$ and $y$ directions. $E$ is the strength of an externally applied electric field in the $x$-direction. The cell has length 1 cm and $K=2.5 \\times 10^{-6}$ (meter) $^{2} /(\\text { volts })^{2}$. If the light, after passing through the Kerr cell, passes through a polarization analyzer whose plane of polarisation is perpendicular to that of the original beam, calculate the smallest value of $E$ which gives maximum transmission. Assume the effect of the electric field on reflection at the Kerr cell is negligible.",
        "subject": "OPT",
        "image_path": [
            "images/395_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nDiagram shows light polarized at $45^\\circ$ to the $z$-direction incident (along $+z$) onto a Kerr cell with an applied electric field $E$ (vertical arrow); after passing through two vertical slits separated by distance $d$, the light propagates to a screen, where an $x$-$z$ coordinate system defines the spatial axes."
    },
    {
        "index": 397,
        "question": "A special light source directs 1 watt of light into a flat black ( $100 \\\\%$ absorbing) disc, which is mounted on an axle parallel to the beam (Fig. 2.84). The target starts to spin as it absorbs light. The target is changed from the black surface to a mirror surface. What happens to the torque? Why?",
        "subject": "OPT",
        "image_path": [
            "images/397_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "optional",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA source emits a beam labeled \"light\" (indicated by a zigzag arrow pointing right) toward a circular \"target,\" which is mounted perpendicularly on an \"axle\"; the axle extends horizontally from the target’s center."
    },
    {
        "index": 398,
        "question": "A ruby laser emits light with a wavelength of $6943 \\AA$, which to a very good approximation is a plane wave. What are the amplitudes of the electric and magnetic field vectors of this plane wave propagating through water, if the time-averaged power of the beam in the water is 100 milliwatts $/ \\mathrm{cm}^{2}$ ?",
        "subject": "OPT",
        "image_path": [
            "images/398_0.png"
        ],
        "img_category": "photoelectric_effect",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nEnergy level diagram with three horizontal lines labeled $E_3$, $E_2$, and $E_1$ (from top to bottom), indicating atomic or molecular states. Downward wavy arrows represent transitions: one from $E_3$ to $E_2$, and another from $E_2$ to $E_1$ labeled $h\\nu$, indicating photon emission."
    },
    {
        "index": 401,
        "question": "Solar energy at the rate $800 \\, \\mathrm{W} / \\mathrm{m}^{2}$ strikes a flat solar panel for water heating. If the absorptance dropped by $1 / 2$, how would this affect the final temperature?",
        "subject": "OPT",
        "image_path": [
            "images/401_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA surface labeled \"water\" is exposed to incident radiation with an intensity of $800\\,\\mathrm{W/m^2}$, indicated by four downward arrows. The surface has an absorptivity of $\\alpha = 0.96$. All vectors representing the incident radiation point perpendicularly toward the water surface. The surface is bordered by a shaded boundary on three sides."
    },
    {
        "index": 414,
        "question": "A spring is hung vertically from a fixed point. A mass M is hung from the other end of the spring, as illustrated in Fig. 3.1. The mass is displaced downwards and then released. The subsequent motion of the mass is simple harmonic. The variation with time $t$ of the length $L$ of the spring is shown in Fig. 3.2. (b) Use data from Fig. 3.2 to determine, for the motion of the mass: the angular frequency $\\omega$.",
        "subject": "CM",
        "image_path": [
            "images/414_0.png",
            "images/414_1.png",
            "images/414_2.png"
        ],
        "img_category": "spring_force",
        "vision_relevance": "essential",
        "language": "English",
        "level": 2,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA mass $M$ is suspended vertically from a fixed support by a spring; the spring has an unstretched length, and the stretched length is labeled $L$. The vertically hanging spring connects the support to the mass, and all labels (“spring”, “mass $M$”, and $L$) indicate their respective positions. No explicit forces or additional vectors are shown."
    },
    {
        "index": 441,
        "question": "将质量为 $m$ 的小球挂在倾角为 $\\theta$ 的光滑斜面上，如图所示。当斜面的加速度至少为多大时，小球开始脱离斜面？（分别取地面为参考系和取斜面为参考系计算。）",
        "subject": "CM",
        "image_path": [
            "images/441_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA wedge is positioned on a horizontal surface with its inclined plane angled at $\\theta$ to the horizontal; a block rests on the incline. The entire wedge is subjected to a horizontal acceleration $\\vec{a}$ directed to the left, as indicated by the labeled vector."
    },
    {
        "index": 442,
        "question": "传动轴 $A B$ 上装有三个轮，重分别为 $P_{1}=3 \\mathrm{kN}, P_{2}=5 \\mathrm{kN}, P_{3}=2 \\mathrm{kN}$ ，尺寸如图所示．欲使轴承 $A$ 的反力与轴承 $B$ 的反力相等，求重为 $P_{2}$ 的轮到轴承 $B$的距离 $x$ ．轴的重量不计．",
        "subject": "CM",
        "image_path": [
            "images/442_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 6,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA horizontal shaft of length $300\\,\\text{cm}$ is supported at points $A$ and $B$ on either end, with three pulleys $P_1$, $P_2$, and $P_3$ placed along the shaft. The distances between $A$ and $P_1$, and between $P_3$ and $B$, are each $95\\,\\text{cm}$. The distance between pulleys $P_2$ and $P_3$ is labeled as $x$. All components rest parallel to the ground."
    },
    {
        "index": 458,
        "question": "一矩形线圈长 $l=20\\,\\mathrm{cm}$，宽 $b=10\\,\\mathrm{cm}$，由 100 匝表面绝缘的导线绕成，放置在一根长直导线的旁边，并和直导线在同一平面内，该长直导线是一个闭合回路的一部分，其余部分离线圈很远，其影响可略去不计。求习题 9－24 图（a）情况下，线圈与长直导线间的互感。",
        "subject": "EM",
        "image_path": [
            "images/458_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nTwo identical rectangular conducting loops of width $b$ and height $l$ are shown near imaginary vertical dashed lines: in (a), the left edge of the loop is at a distance $b$ from the dashed line, while in (b), the loop's center is aligned with the dashed line, placing each edge $b/2$ from it; dimensions $b$ and $l$ are indicated."
    },
    {
        "index": 460,
        "question": "The variation with frequency $f$ of the amplitude $A$ of a transmitted radio wave after amplitude modulation by an audio signal is shown in Fig. 5.1. For this transmission, determine: the wavelength of the carrier wave.",
        "subject": "EM",
        "image_path": [
            "images/460_0.png"
        ],
        "img_category": "coordinate_system",
        "vision_relevance": "essential",
        "language": "English",
        "level": 2,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nPlot of amplitude $A$ versus frequency $f$ in kHz, showing a symmetrical dip (minimum) at $f = 1500$ kHz with neighboring maxima around $1495$ kHz and $1505$ kHz; the vertical and horizontal axes are labeled with $A$ and $f/\\mathrm{kHz}$, respectively, and the origin is marked at $0$. Arrow on the $A$ axis points upward."
    },
    {
        "index": 461,
        "question": "均质杆 $A B$ 用铰链 $A$ 固定在铅垂墙上，并用绳子 $B C$ 吊住，杆与铅垂线的夹角为 $60^{\\circ}$ ，绳子与杆的夹角为 $30^{\\circ}$ ．已知杆重为 20 N ，求较链的反力 $R$ 的大小和方向．",
        "subject": "CM",
        "image_path": [
            "images/461_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 6,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nThree points, $A$, $B$, and $C$, are shown, where $A$ and $C$ are fixed to a wall and $A$ is a pin joint; two rods or links $AB$ and $AC$ are connected at $A$ and $B$ or $C$ respectively, forming a triangle. The angle between $AB$ and the vertical is $60^\\circ$, and the angle between $AB$ and $AC$ at $A$ is $30^\\circ$. No forces or vectors are depicted."
    },
    {
        "index": 469,
        "question": "如图所示，在水平地面上，有一横截面 $S=0.20 \\text{ m}^{2}$ 的直角弯管，管中有流速为 $v=3.0 \\text{ m/s}$ 的水通过，弯管所受力的大小为 $\\boxed{\\text{ }}$ ，方向为 $\\boxed{\\text{ }}$。",
        "subject": "CM",
        "image_path": [
            "images/469_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA bent pipe connects point $A$ (vertical section) to point $B$ (horizontal section), turning $90^\\circ$; fluid flows through the pipe from $A$ to $S$ in the horizontal section, exiting at $S$ with velocity vector $\\vec{v}$ directed rightward. Flow lines are shown, indicating movement from top to right."
    },
    {
        "index": 479,
        "question": "A light rod of length $l$ with a small ball of mass $m$ attached to its upper end can rotate freely without friction around its lower end fixed at point $O$ in space. A vertical $z$-axis is drawn upward from point $O$. Initially, the rod makes an angle $\\theta_0$ ($\\theta_0 > 0$) with the $z$-axis, and the ball has an initial velocity $v_0$ that is horizontal and perpendicular to the rod, as shown in Figure 1. The $Oxy$ coordinate plane represents a horizontal geometric plane (not a physical table or ground but a plane through which the rod can pass). During the motion, the velocity $v$ of the ball remains perpendicular to the rod and can be orthogonally decomposed into a horizontal component $v_{/\\text{}}$ and a remaining component $v_\\text{}$ within the plane perpendicular to the rod. During the motion, when the angle between the rod and the $z$-axis is $\\theta$ ($\\theta > 0$), determine the values of $v_{/\\text{}}$ and $v_\\text{}$ as shown in Figure 2, and provide the values of $v_{/\\text{}}$ and $v_{\\perp}$ when $\\theta = \\frac{\\pi}{2}$;",
        "subject": "CM",
        "image_path": [
            "images/479_0.png",
            "images/479_1.png",
            "images/479_2.png"
        ],
        "img_category": "linear_motion",
        "vision_relevance": "optional",
        "language": "English",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA particle of mass $m$ is attached to point $O$ by a rigid rod of length $l$ and is positioned such that the rod makes an angle $\\theta_0$ with the vertical $z$-axis in the $yz$-plane; the initial velocity $\\vec{v}_0$ is directed into the page (negative $x$-direction, denoted by $\\otimes$). The coordinate axes $x$, $y$, and $z$ are shown, and gravity $\\vec{g}$ points downward along the negative $z$-axis."
    },
    {
        "index": 481,
        "question": "An alternating voltage of peak value 150 V is applied across the 1200 turns of the primary coil. The variation with time $t$ of the e.m.f. $E$ induced across the secondary coil is shown in Fig.9.2. Use data from Fig. 9.2 to state one time when the magnetic flux linking the secondary coil is a maximum.",
        "subject": "EM",
        "image_path": [
            "images/481_0.png"
        ],
        "img_category": "coordinate_system",
        "vision_relevance": "essential",
        "language": "English",
        "level": 2,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA graph of voltage $E$ (vertical axis, labelled $E/V$) versus time $t$ (horizontal axis, labelled $t/\\text{ms}$) showing a sinusoidal waveform, with $E$ ranging from $-60\\,\\text{V}$ to $+60\\,\\text{V}$ and $t$ ranging from $0$ to $25\\,\\text{ms}$; positive and negative peaks and zero-crossings are clearly indicated."
    },
    {
        "index": 484,
        "question": "长 $l=0.40 \\text{ m}$ ，质量 $M=1.00 \\text{ kg}$ 的匀质木棒，可绕水平轴 $O$ 在坚直平面内转动，开始时棒自然坚直悬垂，现有质量 $m=8 \\text{ g}$ 的子弹以 $v=200 \\text{ m/s}$ 的速度从 $A$ 点射入棒中，$A, ~ O$ 点的距离为 $3l/4$ ，如图所示。求：棒的最大偏转角。",
        "subject": "CM",
        "image_path": [
            "images/484_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA uniform rod of length $4l$ is pivoted at point $O$ on the ceiling and hangs vertically; point $A$ is marked at a distance $l$ from the lower end of the rod. An arrow labeled at $A$ points horizontally to the right."
    },
    {
        "index": 485,
        "question": "如习题 7－47图所示，$C_{1}=10\\,\\mu\\mathrm{F},\\; C_{2}=5.0\\,\\mu\\mathrm{F},\\; C_{3}=5.0\\,\\mu\\mathrm{F}$。在 $A,\\; B$ 间加上 100 V 的电压，求 $C_{2}$ 上的电压。",
        "subject": "CM",
        "image_path": [
            "images/485_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nCircuit diagram showing points $A$ and $B$ connected by three capacitors: $C_1$ and $C_2$ are arranged in parallel between $A$ and an intermediate node, then $C_3$ is connected from that node to $B$, forming a parallel-series configuration."
    },
    {
        "index": 492,
        "question": "如图所示，两振动方向相同的平面简谐波波源分别位于 $A, ~ B$ 两点。设它们相位相同，且频率均为 $\\nu=30 \\text{~Hz}$ ，波速 $u=0.50 \\text{~m/s}$ 。求在 $P$ 点处两列波的相位差。",
        "subject": "CM",
        "image_path": [
            "images/492_0.png"
        ],
        "img_category": "linear_motion",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nRight-angled triangle $ABP$ with horizontal side $AB$, hypotenuse $AP$ of length $3\\,\\mathrm{cm}$, and angle $\\angle\\,BAP = 30^\\circ$; vectors are shown from $A$ to $P$ and from $B$ to $P$ along segment $AP$."
    },
    {
        "index": 523,
        "question": "Two capacitors of capacitances $22 \\mu \\mathrm{~F}$ and $47 \\mu \\mathrm{~F}$, and a resistor of resistance $2.7 \\mathrm{M}\\Omega$, are connected into the circuit of Fig. 5.2. The battery has an e.m.f. of 12 V. Calculate the combined capacitance of the two capacitors.",
        "subject": "EM",
        "image_path": [
            "images/523_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 2,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA series circuit diagram showing a 12 V battery, a 2.7 MΩ resistor, and two capacitors (22 μF and 47 μF) arranged in series. A switch S is connected between points X and Y, controlling the connection within the circuit. All component values and terminals are clearly labeled."
    },
    {
        "index": 528,
        "question": "A fixed mass of an ideal gas has volume $2.40 \\times 10^{3} \\;\\mathrm{cm}^{3}$ at pressure $3.51 \\times 10^{5} \\;\\mathrm{Pa}$ and temperature 290 K. The gas is heated at constant volume until the temperature is 310 K at pressure $3.75 \\times 10^{5} \\;\\mathrm{Pa}$. The quantity of thermal energy required to raise the temperature of 1.00 mol of the gas by 1.00 K at constant volume is 12.5 J. Calculate, to three significant figures, the amount, in mol, of the gas.",
        "subject": "TSM",
        "image_path": [
            "images/528_0.png"
        ],
        "img_category": "thermodynamics",
        "vision_relevance": "optional",
        "language": "English",
        "level": 2,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nTwo containers, each with volume $2.40 \\times 10^3\\, \\mathrm{cm}^3$, are shown. The left container has pressure $3.51 \\times 10^5\\, \\mathrm{Pa}$ and temperature $290\\,\\mathrm{K}$; the right container has pressure $3.75 \\times 10^5\\, \\mathrm{Pa}$ and temperature $310\\,\\mathrm{K}$. An arrow between the containers points from left to right."
    },
    {
        "index": 538,
        "question": "The circuit for a non-inverting amplifier incorporating an ideal op-amp is shown in Fig. 7.1. The light-emitting diode (LED) emits light when the potential difference across it is at least 2.0 V. The current in the LED must not be greater than 20 mA. Determine the value of $V_{\\text{IN}}$ for which the value of $V_{\\text{OUT}}$ is +2.0 V.",
        "subject": "EM",
        "image_path": [
            "images/538_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 2,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nFigure shows an operational amplifier powered by $+5.0\\,\\mathrm{V}$ and $-5.0\\,\\mathrm{V}$, with the inverting input (–) connected to a voltage divider made of $800\\,\\Omega$ (to ground) and $4.0\\,\\mathrm{k}\\Omega$ (feedback from output), the non-inverting input (+) connected to input voltage $V_\\mathrm{IN}$, and the output driving a series combination of a resistor $R$ and a light-emitting diode (LED) to ground, with output voltage labeled $V_\\mathrm{OUT}$. All connections and voltage directions are indicated by arrows."
    },
    {
        "index": 544,
        "question": "Two blocks $X$ and $Y$ are in contact on a frictionless horizontal surface. A constant $35 N$ force is applied to the right onto block $X$. What is the magnitude of the force that block $Y$ exerts onto block $X$?",
        "subject": "CM",
        "image_path": [
            "images/544_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "English",
        "level": 3,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nTwo blocks, labeled $X$ ($6\\,\\mathrm{kg}$) and $Y$ ($15\\,\\mathrm{kg}$), are in contact on a horizontal surface; a horizontal force of $35\\,\\mathrm{N}$ (indicated by a rightward arrow) is applied to the left side of block $X$."
    },
    {
        "index": 547,
        "question": "如图所示为一装有喷嘴的水枪，在活塞上施加力 $F$ 时，水枪内部的水可以从喷嘴中喷出。设水枪的半径为 $R$ ，喷嘴半径为 $d$ 。求施加力 $F$时，水的喷出速度。",
        "subject": "CM",
        "image_path": [
            "images/547_0.png"
        ],
        "img_category": "linear_motion",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA horizontal cylinder contains a fluid being pushed rightward by a piston (subjected to force $F$) at the left end; the piston moves with velocity $v'$, and the fluid exits to the right through a tube of diameter $2d$ with velocity $v$. The cylinder has an internal diameter $2R$. The pressure is labeled $p_1$ on the piston side and $p_2$ at the exit; arrows indicate the direction of velocities $v'$ and $v$ (both to the right)."
    },
    {
        "index": 553,
        "question": "Five identical light bulbs are connected into a circuit as shown. All wires are ideal with no resistance, and the ideal battery has emf $\\xi$. When the switch S in the circuit is closed, aside from bulb #5, which bulbs brighten?",
        "subject": "EM",
        "image_path": [
            "images/553_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 3,
        "sig_figs": "",
        "caption": "IMAGE 1:\nThe diagram depicts a DC circuit consisting of a battery with emf $\\xi$, five identical bulbs labeled #1 through #5, and a switch labeled $S$; the bulbs are arranged with #1, #2, and #3 forming a parallel network, #4 and #5 in parallel branches, and the switch $S$ connected in series with bulb #5."
    },
    {
        "index": 554,
        "question": "For the change in the gas described above, state the quantity of external work done on the gas.",
        "subject": "TSM",
        "image_path": [
            "images/554_0.png"
        ],
        "img_category": "thermodynamics",
        "vision_relevance": "essential",
        "language": "English",
        "level": 2,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo gas containers are shown: the left box is labeled with volume $2.40 \\times 10^3\\,\\mathrm{cm}^3$, pressure $3.51 \\times 10^5\\,\\mathrm{Pa}$, and temperature $290\\,\\mathrm{K}$; the right box is labeled with the same volume, $2.40 \\times 10^3\\,\\mathrm{cm}^3$, pressure $3.75 \\times 10^5\\,\\mathrm{Pa}$, and temperature $310\\,\\mathrm{K}$. An arrow pointing from the left box to the right box indicates a process or transfer occurring in that direction."
    },
    {
        "index": 583,
        "question": "一轻绳绕过一定滑轮，滑轮轴光滑，滑轮的质量为 $m/4$ ，均匀分布在其边缘上。绳子的一端有一质量为 $m$ 的人 A 抓住了绳端，而在绳的另一端系了一质量为 $m/2$ 的重物 B。设人从静止开始相对绳以匀速向上爬时，绳与滑轮间无相对滑动，求重物 B 上升的加速度？（已知滑轮对过滑轮中心且垂直于轮面的轴的转动惯量 $J=mR^{2}/4$。）",
        "subject": "CM",
        "image_path": [
            "images/583_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nDiagram shows a fixed pulley (axis at $O$) mounted to the ceiling; a person at position $A$ pulls downward on one end of a rope passing over the pulley, while a suspended block at position $B$ hangs from the other end of the rope, illustrating a mechanical lifting setup."
    },
    {
        "index": 626,
        "question": "Estimate the coherence time $\\tau_{c}$ of an optical field whose spectral contour $G(\\omega)$ in the circular frequency scale $\\omega$ has the width $\\Delta \\omega \\approx 2 \\pi \\cdot 0.05 \\cdot 10^{14} \\mathrm{~Hz}$ at the half-maximum value of the spectral density.",
        "subject": "OPT",
        "image_path": [
            "images/626_0.png"
        ],
        "img_category": "coordinate_system",
        "vision_relevance": "essential",
        "language": "English",
        "level": 6,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA graph of $G(\\omega)$ versus $\\omega$ showing a peak centered at $\\omega_0$ with its full width at half maximum indicated as $\\Delta\\omega$; vertical and horizontal dashed lines mark $\\omega_0$ and the width $\\Delta\\omega$, respectively."
    },
    {
        "index": 634,
        "question": "What is the instantaneous acceleration of an object moving along a straight line at the time of $t=5.0 \\text{ s}$, given the velocity vs. time graph?",
        "subject": "CM",
        "image_path": [
            "images/634_0.png"
        ],
        "img_category": "coordinate_system",
        "vision_relevance": "essential",
        "language": "English",
        "level": 3,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA velocity-time graph with velocity $v$ (in m/s) on the vertical axis and time $t$ (in s) on the horizontal axis, showing a sinusoidal variation of $v$ from $+10$ to $-10$ over a time interval of $0$ to $10$ seconds. The curve starts at $v=0$ at $t=0$, reaches a maximum at $t \\approx 2.5$ s, crosses $v=0$ at $t=5$ s, attains a minimum at $t \\approx 7.5$ s, and returns to $v=0$ at $t=10$ s."
    },
    {
        "index": 652,
        "question": "如电图 2.9.1 所示，半径为 $R$ ，质量为 $m$ 的匀质细圆环上均匀地分布着相对圆环固定不动的正电荷，总电量为 $Q \\cdot t=0$ 时，圆环在水平地面上具有沿正东方向的平动速度 $\\boldsymbol{v}_{0}$ ，且无滚动。假设圆环与地面之间的摩擦系数为 $\\mu$ ，在圆环周围只有沿水平面指向北方（电图2.9.1 中垂直纸面向里为北方）的匀强地磁场 $B$ 。 若 $v_{0}$ 在第 1 问的取值范围内，假设圆环最后能达到纯滚状态，试导出在达到纯滚前，圆环的平动速度 $v$ 与时间 $t$的关系。",
        "subject": "CM",
        "image_path": [
            "images/652_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA uniform sphere of mass $m$, charge $Q$, and radius $R$ (centered at point $O$) rests on a horizontal surface with coefficient of friction $\\mu$; it is initially moving eastward with velocity $\\vec{v}_0$. A uniform magnetic field $\\vec{B}$ is directed into the page (indicated by $\\otimes$). The west–east direction is marked alongside the surface."
    },
    {
        "index": 659,
        "question": "在匀强电场 $\\boldsymbol{E}$ 中，有一半径为 $R$ 的闭合半球面，其底面与电场线垂直，如图所示。试求：通过闭合半球面底面的电场强度通量。",
        "subject": "EM",
        "image_path": [
            "images/659_0.png"
        ],
        "img_category": "charge_distribution",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA closed surface of radius $R$ centered at point $O$ is depicted, with a uniform electric field $\\vec{E}$ represented by parallel arrows pointing to the right and passing through the surface."
    },
    {
        "index": 667,
        "question": "图示梁 $A B$ 由铅垂杆 $C D$ 支持于水平位置．梁的一端作用的力 $F=$ 30 kN 与水平线成 $60^{\\circ}$ 角．在 $A, C$ 与 $D$ 各点的连接均为铰链连接，按图示尺寸求杆 $C D$ 的内力 $S$ 和梁对墙的压力 $Q$ ．杆与梁的重量不计．",
        "subject": "CM",
        "image_path": [
            "images/667_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 6,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nDiagrams (a) and (b) each show a horizontal bar $ABC$ of length $3\\,\\mathrm{m}$, with hinge at $A$ and pin connection at $C$, subjected to a force $\\vec{F}$ of magnitude $F$ applied at point $B$ at an angle $60^\\circ$ above the bar. In (a), vertical member $CD$ extends upward from $C$ to a fixed support at $D$; in (b), $CD$ extends downward to a fixed support at $D$. Segment $AB=1\\,\\mathrm{m}$, $BC=2\\,\\mathrm{m}$. Directions of all forces/vectors, points, and distances are clearly labeled."
    },
    {
        "index": 684,
        "question": "一个质量 $m=4 \\mathrm{~kg}$ 表面光滑的凹槽，静止放在光滑的水平地面上，槽的凹面呈圆弧形，其半径 $R=0.2 \\mathrm{~m}$ 如图所示。槽的 A 端与圆弧中心 $O$ 点在同一平面上，B 端与 $O$ 点的连线与坚直方向间的夹角 $\\theta=60^{\\circ}$ 。今有一质量 $m^{\\prime}=1 \\mathrm{~kg}$ 的小滑块自 A 端从静止开始沿槽面滑下。求小滑块在 B 端滑出时，凹槽相对地面的速度。",
        "subject": "CM",
        "image_path": [
            "images/684_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA fixed smooth track consists of a vertical circular arc of radius $R$ connecting points $A$ and $B$, oriented upright on a horizontal surface. Two masses are shown: $m$ at the bottom of the arc, and $m'$ at position $A$ (the right upper end of the arc). Point $O$ is defined above the arc with an angle $\\theta$ shown between the line $OB$ and the vertical, and a vertical arrow indicating the direction from $O$ downward."
    },
    {
        "index": 689,
        "question": "如电图 2.8.1 所示，在水平面上有一根光滑的刚性细长杆，它可以无摩擦地绕固定的坚直轴旋转，转动惯量为 $I$ 。在杆周围有与转轴平行的匀强磁场 $B$ ，其方向如电图 2.8.1 所示。把质量为 $m$ ，电量为 $q(q>0)$ 的光滑带电小圆环套在杆上，设环与杆之间无电荷转移。 试问：杆连同环的旋转角速度 $\\\\omega$ 取何值时，环在杆上任何位置均可相对杆静止？",
        "subject": "EM",
        "image_path": [
            "images/689_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA rigid rod with mass $m$ and charge $q$ is mounted on a fixed axis and rotates about this axis with angular velocity $\\omega$. The entire system is immersed in a uniform magnetic field $\\vec{B}$ pointing into the page (indicated by crossed circles and label $\\vec{B}$)."
    },
    {
        "index": 717,
        "question": "如电图 3.18.1 所示，在光滑的水平面上，有边长为 $l=0.8 \\text{ m}$ 的正方形导线框，其质量 $m=100 \\text{ g}$，自感 $L=10^{-3} \\text{ V} \\cdot \\text{s} / \\text{A}$，电阻可忽略不计。在 $t=0$ 时，线框右侧 $bc$ 边所在位置刚好是匀强磁场区域的左边界，磁场区域的宽度为 $s=0.2 \\text{ m}$，$\\boldsymbol{B}$ 的方向垂直纸面（即水平面）向里，$B=0.5 \\text{ T}$。如电图 3.18.1 所示，取 $t=0$ 时 $bc$ 边所在位置为坐标原点 $O$，取 $x$ 轴与 $bc$ 边垂直。导线框以沿 $x$ 轴正方向的初速 $v_{0}$ 运动，忽略空气阻力。设 $v_{0}=4 \\text{ m}/\\text{s}$，试求 $t=\\frac{\\pi}{36} \\text{ s}$ 时刻，$bc$ 边所在的位置 $x_{c}$。",
        "subject": "EM",
        "image_path": [
            "images/717_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA square conducting loop $abcd$ of side length $l$ is positioned in the $xy$-plane with side $bc$ initially aligned along the $y$-axis and adjacent to region $O$; side $bc$ moves to the right along the $x$-axis with velocity $v_0$. A uniform magnetic field $\\vec{B}$ directed into the page (denoted by $\\otimes$, i.e., $-\\hat{z}$) exists in the region of width $s$ to the right of $O$. The $x$-axis is indicated."
    },
    {
        "index": 723,
        "question": "In a Michelson interferometer with point light source S, having central wavelength \\lambda_{0} and width of the spectral contour \\Delta \\lambda, one of the mirrors ( \\mathrm{M}_{2} in the figure) harmonically oscillates with amplitude l_{0} \\gg l_{c}, where l_{c} is the length of temporal coherence. The photodetector PD mounted at the output of the interferometer registers interference oscillations of the light intensity I\\left(z_{2}\\right) depending on the position z_{2} of the interferometer mirror \\mathrm{M}_{2}. These oscillations with total number m are schematically plotted in the figure. Determine the approximate value of the coherence length l_{c} and spectral width \\Delta \\lambda if the period \\Delta z_{2} of intensity oscillation I\\left(z_{2}\\right) is \\Delta z_{2}=0.3 \\mu \\mathrm{~m}.",
        "subject": "OPT",
        "image_path": [
            "images/723_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "English",
        "level": 6,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nThe diagram shows a Michelson interferometer: light from source $S$ is split by beamsplitter $BS$, travels to mirrors $M_1$ and $M_2$, and recombines at $BS$ before reaching photodetector $PD$. Mirror $M_2$ is displaced vertically by $z_2$ from $2l_0$, adjusting the optical path difference. The resulting interference intensity $I(z_2)$ is plotted versus $z_2$ on the right, showing oscillations as $z_2$ varies. All vector arrows indicate the direction of light propagation."
    },
    {
        "index": 725,
        "question": "For the change in the gas described above, state the change in internal energy, with the direction of this change.",
        "subject": "TSM",
        "image_path": [
            "images/725_0.png"
        ],
        "img_category": "thermodynamics",
        "vision_relevance": "optional",
        "language": "English",
        "level": 2,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo boxes, each labeled with volume ($2.40 \\times 10^3~\\mathrm{cm}^3$), pressure ($3.51 \\times 10^5~\\mathrm{Pa}$ and $3.75 \\times 10^5~\\mathrm{Pa}$), and temperature ($290~\\mathrm{K}$ and $310~\\mathrm{K}$), are connected by a line with a rightward-pointing arrow indicating a process or flow from the first (left) box to the second (right) box."
    },
    {
        "index": 733,
        "question": "\\n形状如图所示的导线，通有电流 $I$ ，放在与均匀强磁场垂直的平面内，导线所受的磁场力 $F=$ $\\n",
        "subject": "EM",
        "image_path": [
            "images/733_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA wire carrying current $I$ follows the path $abcde$: segment $ab$ runs straight from point $a$ to $b$ (length $l$), $bc$ runs horizontally to $c$, then $cde$ forms a quarter-circle of radius $R$ centered at point $O$, ending at $e$. The region contains a uniform magnetic field $\\vec{B}$ perpendicular to the plane, directed into the page (indicated by crosses). Arrows indicate current direction along the path. Points $a$, $b$, $c$, $d$, $e$, and $O$ are labeled."
    },
    {
        "index": 744,
        "question": "In the circuit diagram below, all of the bulbs are identical. Which bulb will be the brightest?",
        "subject": "EM",
        "image_path": [
            "images/744_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 3,
        "sig_figs": "",
        "caption": "IMAGE 1:\nSchematic of an electric circuit including a $10\\,\\mathrm{V}$ battery, and four labeled nodes/components: A and B are in parallel branches, both between node C (bottom left) and node D (right); current flows from the positive terminal of the battery through node C, then splits to pass through A or B, recombining at D before returning to the battery."
    },
    {
        "index": 755,
        "question": "$N$ 个一阶正离子与 $N$ 个一阶负离子静止地在一条直线上等间距交错排列，相邻间距为 $a$，图中字母 $e$ 代表电子电量绝对值， 当 $N$ 足够大时，每一个离子所具有的电势能均可近似处理为(1)、(2)所得的 $W_{+}$或 $W_{-}$，试求全系统所具有的电势能 $W$",
        "subject": "EM",
        "image_path": [
            "images/755_0.png"
        ],
        "img_category": "charge_distribution",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA linear array of alternating point charges, with charges labeled $+e$ and $-e$, are equally spaced by a distance $a$; the diagram repeats this pairing infinitely in both directions."
    },
    {
        "index": 757,
        "question": "Determine frequency $f_{s}$ of an alternating electric signal applied to the piezoelectric transducer of an acousto-optical cell if the laser beam diffracted by the acoustic wave in the cell is observed propagating at an angle $\\alpha=6 \\mathrm{deg}$ with respect to the direction of the laser beam incident on the cell. The velocity of the sound propagation in the cell crystal is $v_{a}=5960 \\mathrm{~m} / \\mathrm{s}$ (silica, $\\mathrm{SiO}_{2}$ ). The laser beam wavelength is $\\lambda_{0}=0.6328 \\mu \\mathrm{~m}$. ",
        "subject": "OPT",
        "image_path": [
            "images/757_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "English",
        "level": 6,
        "sig_figs": "1",
        "caption": "IMAGE 1:\nParallel light rays are incident on a birefringent PET (polyethylene terephthalate) optical element, which is oriented such that the rays emerge at different angles relative to each other, separated by angle $\\alpha$; the system operates with frequency $f_s$, as indicated at the base of the element, and arrows mark the propagation direction of the light."
    },
    {
        "index": 778,
        "question": "Two coils of insulated wire are wound on an iron bar, as shown in Fig. 8.1. There is a current $I_{1}$ in coil 1 that varies with time $t$ as shown in Fig. 8.2. The variation with $t$ of $I_{1}$ can be represented by the equation $I_{1}=X\\sin Yt$ where $X$ and $Y$ are constants. Use Fig. 8.2 to determine the values of $X$ and $Y$. Give units with your answers. $X=$ and $Y=$",
        "subject": "EM",
        "image_path": [
            "images/778_0.png",
            "images/778_1.png",
            "images/778_2.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "English",
        "level": 2,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nAn iron bar passes horizontally through two coils, labeled coil 1 and coil 2; coil 1 (left) is connected to an alternating current source providing current $I_1$ (upward direction indicated), while coil 2 (right) is connected to a voltmeter measuring voltage $V_2$; an arrow labeled $V_2$ indicates voltage measurement direction, and all components are explicitly labeled."
    },
    {
        "index": 785,
        "question": "A heater supplies energy at a constant rate to 0.045 kg of a substance. The variation with time of the temperature of the substance is shown in Fig. 3.1. The substance is perfectly insulated from its surroundings. The power of the heater is 150 W. Use data from Fig. 3.1 to calculate, in $\\mathrm{kJ} \\mathrm{kg}^{-1}$, the specific latent heat of vaporisation $L$ of the substance.",
        "subject": "TSM",
        "image_path": [
            "images/785_0.png"
        ],
        "img_category": "coordinate_system",
        "vision_relevance": "essential",
        "language": "English",
        "level": 2,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nTemperature-time graph showing temperature in $^\\circ$C (vertical axis) versus time in minutes (horizontal axis), with a plot starting at $-120^\\circ$C, rising sharply to $+65^\\circ$C, remaining constant, and then increasing again near 8 minutes; points $P$ and $Q$ are labeled on the curve around $(2\\,\\text{min}, 0^\\circ\\text{C})$ and $(9\\,\\text{min}, 80^\\circ\\text{C})$ respectively."
    },
    {
        "index": 790,
        "question": "厚玻璃块上方镀有双层增透膜，参量如图示，且有 $n_{0}<n_{1}<n_{2}>n_{3}$ 。以波长为 $\\lambda$ 的单色光垂直入射到增透膜上，设三束反射光（只考虑一次反射）$a, b, c$ 在空气中的振幅相等，欲使这三束光相干叠加后的总强度为零，则第一层膜的最小厚度 $d_{1}$ 和第二层膜的最小厚度 $d_{2}$ 各为何值？",
        "subject": "OPT",
        "image_path": [
            "images/790_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nThree horizontal layers with refractive indices $n_0$, $n_1$, $n_2$, and $n_3$ are arranged from top to bottom; the first layer ($n_1$) has thickness $d_1$, the second layer ($n_2$) has thickness $d_2$. An incident ray of wavelength $\\lambda$ enters from the top ($n_0$), splitting into three reflected rays labeled $a$, $b$, and $c$, each indicated by arrows pointing upward from the interfaces."
    },
    {
        "index": 802,
        "question": "在半径为 $a$，电荷体密度为 $\\rho$ 的均匀带电球内，挖去一个半径为 $b$ 的小球，$OO'=c$，如图所示。试求：$P^{\\prime}$ 点的电场强度。$O, ~ O^{\\prime}, ~ P, ~ P^{\\prime}$ 在一条直线上。",
        "subject": "EM",
        "image_path": [
            "images/802_0.png"
        ],
        "img_category": "charge_distribution",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo concentric circles of radii $R$ (center $O$) and $r$ (center $O'$) are shown, with $O'$ displaced rightward along the common horizontal line. Points $P'$ and $P$ lie on this horizontal line to the left of $O$, $O'$. Radii $R$ and $r$ are drawn from $O$ to its circle and $O'$ to its circle, respectively, each indicated by their respective arrowed lines."
    },
    {
        "index": 804,
        "question": "宇宙飞船放下一个仪器，以恒定速度垂直下落接近某行星表面，同时将外界大气压强数据传送给飞船，压强 $p$（用某个约定的单位）随时间 $t$ 的变化曲线如图所示。落到行星表面时，仪器又测得周围温度 $T=700 \\mathrm{~K}$ ，自由落体加速度 $g=10 \\mathrm{~m} / \\mathrm{s}^{2}$ 。如果已知该行星的大气由二氧化碳构成，试求仪器下落的速度 $v$ 。",
        "subject": "TSM",
        "image_path": [
            "images/804_0.png"
        ],
        "img_category": "coordinate_system",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA graph with vertical axis labeled $p$ (in approximate units, 约定单位) and horizontal axis labeled $t/s$ (time in seconds), plotting a curve that increases nonlinearly; point $S$ is marked on the curve at $t \\approx 3800$ s, with two dashed lines passing vertically and horizontally through $S$ to the axes."
    },
    {
        "index": 807,
        "question": "Determine the ray velocities for the ordinary $(u_{o})$ and extraordinary $(u_{e})$ waves propagating through a uniaxial anisotropic medium at the angle $\\theta=30$ deg to the optical axis $\\mathrm{O}-\\mathrm{O}^{\\prime}$ if the principal values of the permittivity of the medium are $\\varepsilon_{\\perp}=2.749$ and $\\varepsilon_{\\|}=2.208$.",
        "subject": "OPT",
        "image_path": [
            "images/807_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "English",
        "level": 6,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA line segment $OO'$ is shown horizontally, with another line intersecting at an angle $\\theta$. Two vectors, $\\vec{u}_o$ (closer to $O$) and $\\vec{u}_e$ (further along the intersection), are drawn from the intersection point along the slant line; both point away from $OO'$ and form an angle $\\theta$ with it."
    },
    {
        "index": 855,
        "question": "一柱面平凹透镜 A ，曲率半径为 $R$ ，放在平玻璃片 B 上，如习题 12－22图所示。现用波长为 $\\lambda$ 的单色平行光自上方垂直往下照射，观察 A 和 B 间空气薄膜的反射光的干涉条纹。如空气薄膜的最大厚度 $d=2\\lambda$ 。共能看到多少明条纹",
        "subject": "OPT",
        "image_path": [
            "images/855_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA rectangular block consists of two parallel plates labeled $A$ and $B$, separated by an air gap of thickness $d$ (竖直标注) shown at the left edge; the gap is visually indicated between the plates. The direction $d$ is marked perpendicular to the plates, denoting the width of the air gap."
    },
    {
        "index": 856,
        "question": "一实验装置如图所示，一块平板玻璃片上放一油滴．当油滴展开成油膜时，在单色平行光（波光 $\\lambda=600 \\mathrm{~nm}$）垂直照射下，从反射光中观察油膜所形成的干涉条纹（用读数显微镜观察），已知玻璃的折射率 $n_{1}=1.50$ ，油膜的折射率 $n_{2}=1.20$ 。当油膜中心最高点与玻璃片的上表面相距 $h=1.2\\mu\\mathrm{~m}$ 时，描述所看到的条纹情况。可以看到几条明条纹？",
        "subject": "OPT",
        "image_path": [
            "images/856_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA point light source labeled $S$ emits rays toward a partially reflecting glass plate; transmitted and reflected rays are shown, with reflected rays traveling vertically downward to a horizontal oil film labeled \"油膜\" (thickness $h$), deposited on a substrate. All rays are indicated with arrows showing direction—initially downward from $S$, reflected vertically toward the film, and vertical after interaction with the film's surface."
    },
    {
        "index": 858,
        "question": "一弹簧，劲度系数为 $k$ ，一端固定在 $A$ 点，另一端连一质量为 $m$ 的物体，靠在光滑的半径为 $R$ 的圆柱体表面上，弹簧原长为 $AB$（如图所示）。在变力 $F$ 作用下，物体极缓慢地沿表面从位置 $B$ 移到 $C$ ，求力 $F$ 所做的功。",
        "subject": "CM",
        "image_path": [
            "images/858_0.png"
        ],
        "img_category": "spring_force",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA mass $m$ is attached to a block that can slide along a frictionless semicircular track of radius $R$ centered at $O$. The block is also connected to point $A$ by a spring of natural length $B$. A force $\\vec{F}$ is applied tangentially at point $C$, where the block is located at angle $\\theta$ measured from the horizontal. All labels ($m$, $R$, $O$, $C$, $\\theta$, $F$, $A$, $B$) and the schematic arrangement are shown, with $\\vec{F}$ directed upward and to the left along the tangent to the track at $C$."
    },
    {
        "index": 861,
        "question": "质量 $m=6 \\times 10^{-3}\\,\\mathrm{kg}$ 的小球，系于绳的一端，绳的另一端固结在 $O$ 点，绳长为 $l=1\\,\\mathrm{m}$。今将小球拉升至水平位置 $A$，然后放手，求当小球经过圆弧上 $D$ 点时的速度；假定空气阻力不计，$\\theta=30^{\\circ}$。",
        "subject": "CM",
        "image_path": [
            "images/861_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA mass $m$ located at point $A$ is attached to one end of a light string of length $l$, with the other end fixed at point $O$. The string can swing through an angle $\\theta$ from the vertical, tracing an arc $ABCD$ along a circular path centered at $O$. The angle $\\theta$ is marked at points $A$ and $C$ relative to the central vertical. Dashed lines indicate the positions $OB$ and $OC$, defining the geometry of the swing."
    },
    {
        "index": 864,
        "question": "如图所示，两个摆球并列悬挂，其中摆球 A 质量为 $m_{1}=0.4\\,\\mathrm{kg}$ ，摆球 B 质量为 $m_{2}=0.5\\,\\mathrm{kg}$ 。摆线坚直时，A 和 B 刚好相接触。现将 A 拉过 $\\theta_{1}=40^{\\circ}$ 后释放，当它和 B 碰撞后恰好静止。求：当 B 再次与 A 相碰后，A 能摆升的最高位置 $\\theta_{2}$.",
        "subject": "CM",
        "image_path": [
            "images/864_0.png"
        ],
        "img_category": "simple_harmonic_motion",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nTwo pendulum bobs, labeled $A$ and $B$, are suspended from a common horizontal support by separate strings; bob $A$ is initially displaced to the left, making an angle $\\theta_1$ with the vertical, while bob $B$ hangs vertically at rest. The height $h_1$ indicates the vertical distance by which bob $A$ is raised above its lowest position. An arrowed dashed-line arc shows $A$'s release path toward $B$, indicating a potential collision."
    },
    {
        "index": 868,
        "question": "如图所示，一球面摆，摆长为 $l$ ，摆球的质量为 $m$ ，开始时摆线与坚直线 $O O^{\\prime}$ 成 $\\theta$ 角，摆球的初速度垂直于摆线所在的坚直面。如果摆球在运动过程中摆线的张角 $\\theta$ 最大为 $90^{\\circ}$ ，小球到达 $\\theta=90^{\\circ}$ 时的速度是多少？",
        "subject": "CM",
        "image_path": [
            "images/868_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA particle of mass $m$ is attached to a fixed point $O$ by a light string and moves along a helical path around the vertical axis $OO'$, making a constant angle $\\theta$ with the vertical; the particle's velocity vectors are labeled as $v_0$ at the initial position and $v$ at a later point, with both vectors indicated tangential to the particle's path."
    },
    {
        "index": 869,
        "question": "如图所示，质量为 $m$，半径为 $R$ 的匀质圆柱，可绕其水平轴线自由转动。今有质量 $m_{0}\\,(m_{0}<m)$ 的黏性小球从 $A$ 点自由下落，击中圆柱边缘的 $B$ 处，已知 $A,~B$ 两点的距离为 $h$，$OB$ 与水平成 $\\theta$ 角。试求：小球击中圆柱后，圆柱刚开始转动时的角速度。",
        "subject": "CM",
        "image_path": [
            "images/869_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA particle of mass $m_0$ is positioned at point $A$ at height $h$ above the circumference of a circle with center $O$. Point $B$ is on the circle, subtending an angle $\\theta$ at $O$. Dotted lines indicate the vertical distance from $A$ to $B$ and the radius $\\overline{OB}$."
    },
    {
        "index": 872,
        "question": "如图所示，在质量为 $m$ ，半径为 $R$ 的匀质圆盘上，挖去半径为 $r$ 的两个圆孔，孔心在半径的中点，求剩余部分对圆盘中心且与盘面垂直的轴线的转动惯量。（提示：根据转动惯量的可加性，设想在挖去的小孔处填上正，负质量同质的材料。这样就成为正质量的大圆盘和负质量的小圆盘组合的圆盘。这种方法称为补偿法或称负质量法。）",
        "subject": "CM",
        "image_path": [
            "images/872_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA large circle of radius $R$ centered at $O$ contains two identical smaller circles of radius $r$ with centers at $O_1$ and $O_2$; each small circle is tangent to the large circle and to each other, and line segment $OO_1O_2$ passes through all three centers. Radii $O_1r$ and $OR$ are shown, with $r$ and $R$ labeled."
    },
    {
        "index": 874,
        "question": "$6-10.0 .1 \\mathrm{~mol}$ 的单原子理想气体，经历一准静态直线过程 $ab$ ，如习题 6－10图所示。气体在过程中吸收的热量？",
        "subject": "TSM",
        "image_path": [
            "images/874_0.png"
        ],
        "img_category": "coordinate_system",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "3",
        "caption": "IMAGE 1:\n$O$ is the origin of a $p$-$V$ (pressure–volume) coordinate system. Four points $a$, $b$, $c$, and $d$ form the vertices of a closed cycle. The process path follows arrows: from $a$ to $b$ (curved path upward and right), $b$ to $c$ (leftward straight line at constant $p$), $c$ to $d$ (downward vertical path at constant $V$), and $d$ to $a$ (rightward straight line at constant $p$). The arrows show the sequence and directions of the cyclic process."
    },
    {
        "index": 875,
        "question": "$6-10.0 .1 \\mathrm{~mol}$ 的单原子理想气体，经历一准静态直线过程 $ab$ ，如习题 6－10图所示。气体在过程中内能的变化？",
        "subject": "TSM",
        "image_path": [
            "images/875_0.png"
        ],
        "img_category": "coordinate_system",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA $p$-$V$ diagram showing a closed cyclic process for a thermodynamic system, with vertices labeled $a$, $b$, $c$, and $d$. The process proceeds in the order $a \\rightarrow b \\rightarrow c \\rightarrow d \\rightarrow a$, as indicated by arrows, with $O$ marking the origin of the $p$ (pressure, vertical axis) and $V$ (volume, horizontal axis) axes."
    },
    {
        "index": 895,
        "question": "一铜片厚为 $d=1.0\\,\\mathrm{mm}$，放在 $B=1.5\\,\\mathrm{T}$ 的磁场中，磁场方向与铜片表面垂直，如图所示。已知铜片里每立方米有 $8.4\\times10^{22}$ 个自由电子，当铜片中有电流 $I=200\\,\\mathrm{A}$ 时，求铜片两边的电势差 $U_{a a'}$ 。",
        "subject": "EM",
        "image_path": [
            "images/895_0.png"
        ],
        "img_category": "capacitance_resistance",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA rectangular wire loop with horizontal sides $a$ and $a'$ and vertical sides $b$ and $d$ is partially inserted into a region with uniform magnetic field $\\vec{B}$ (arrows diagonally upward to the right). The loop carries a current $I$ indicated along $b$. The direction of each labeled segment and the orientation of $\\vec{B}$ are shown explicitly."
    },
    {
        "index": 922,
        "question": "A thin copper sheet $X$ is supported on a rigid rod so that it hangs between the poles of a magnet as shown in Fig. 9.3. Sheet $X$ is displaced to one side and then released so that it oscillates. A motion sensor is used to record the displacement of $X$. A second thin copper sheet $Y$ replaces sheet $X$. Sheet $Y$ has the same overall dimensions as $X$ but is cut into the shape shown in Fig. 9.4. The motion sensor is again used to record the displacement. The graph in Fig. 9.5 shows the variation with time $t$ of the displacement $s$ of each copper sheet. Deduce which copper sheet is represented by the dashed line. Explain your answer using the principles of electromagnetic induction.",
        "subject": "EM",
        "image_path": [
            "images/922_0.png",
            "images/922_1.png",
            "images/922_2.png"
        ],
        "img_category": "coordinate_system",
        "vision_relevance": "essential",
        "language": "English",
        "level": 2,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA copper sheet labeled $X$ is attached to a rod and placed between the opposing poles of a magnet, with arrows indicating the direction between the magnetic poles; components labeled are \"copper sheet $X$\", \"rod\", and \"poles of magnet\"."
    },
    {
        "index": 932,
        "question": "A metal sphere of radius $R$ is isolated in space. Point $P$ is a distance $x$ from the centre of the sphere, as illustrated in Fig. 7.1. The variation with distance $x$ of the electric field strength $E$ due to the charge on the sphere is shown in Fig. 7.2. Use Fig. 7.2 to determine the radius $R$ of the sphere.",
        "subject": "EM",
        "image_path": [
            "images/932_0.png",
            "images/932_1.png"
        ],
        "img_category": "charge_distribution",
        "vision_relevance": "essential",
        "language": "English",
        "level": 2,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA circle of radius $R$ is shown, with its center at the intersection of two dashed perpendicular lines. Point $P$ lies along the horizontal dashed line, a distance $x$ from the center of the circle. The diagram labels the radius $R$ within the circle and the distance $x$ between the center and point $P$."
    },
    {
        "index": 933,
        "question": "A uniform electric field is now applied in the same region as the magnetic field. The electron passes undeviated through the region of the two fields, as illustrated in Fig. 9.2. The speed of the electron is $9.0 \\times 10^{6}\\,\\mathrm{ms}^{-1}$. Calculate the magnitude of the electric field strength.",
        "subject": "EM",
        "image_path": [
            "images/933_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "English",
        "level": 2,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA straight arrowed line labeled \"path of electron\" represents an electron entering horizontally from the left and passing through a shaded rectangular region labeled \"region of uniform electric and magnetic fields,\" with the electron's trajectory remaining straight and unchanged in direction throughout."
    },
    {
        "index": 951,
        "question": "The force on the electrons causes a voltage $V_{H}$ to be established across the semiconductor slice given by the expression $V_{\\mathrm{H}}=\\frac{B I}{n t q}$ where $I$ is the current in the slice. State the two faces between which the voltage $V_{H}$ is established.",
        "subject": "EM",
        "image_path": [
            "images/951_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "English",
        "level": 2,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA rectangular block PQRS–FGHE is shown with incident electrons entering perpendicular to face PQEF (from left to right, labeled \"direction of incident electrons\"). A uniform magnetic field with flux density $\\vec{B}$ is depicted by arrows pointing vertically downward (into face SGRH). All vertices (P, Q, R, S, F, G, H, E) are labeled, with reference lines indicating magnetic field direction but no additional forces, currents, or potentials marked."
    },
    {
        "index": 978,
        "question": "The variation with temperature $t$ of the resistance $R$ of a thermistor is shown in Fig. 7.1. The thermistor is connected into the circuit shown in Fig. 7.2. The battery has electromotive force (e.m.f.) 9.00 V and negligible internal resistance. When the temperature of the thermistor is $25^{\\circ} \\mathrm{C}$, the potential difference between the terminals A and B is 1.00 V. The temperature of the thermistor changes from $25^{\\circ} \\mathrm{C}$ to $10^{\\circ} \\mathrm{C}$. Determine, to two significant figures, the change in potential difference between A and B.",
        "subject": "EM",
        "image_path": [
            "images/978_0.png",
            "images/978_1.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 2,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nGraph of resistance $R$ (in k$\\Omega$) plotted on the vertical axis versus temperature $t$ (in °C) on the horizontal axis, showing a downward-sloping curve labeled Fig. 7.1, indicating the dependence of $R$ on $t$ over the range $0 \\leq t \\leq 30$°C and $1.0 \\leq R \\leq 3.5$ k$\\Omega$."
    },
    {
        "index": 993,
        "question": "An object on an inclined plane has a gravitational force of magnitude $10$ N acting on it from the Earth. What are the correct components of this gravitational force for the coordinate axes where the $y$-axis is perpendicular to the incline's surface and the $x$-axis is parallel to the inclined surface?",
        "subject": "CM",
        "image_path": [
            "images/993_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "optional",
        "language": "English",
        "level": 3,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA block is positioned on an inclined plane at an angle of $36.9^\\circ$ to the horizontal; the block is subjected to a downward force labeled $10~\\mathrm{N}$ (shown as a vertical arrow). The coordinate axes are defined with $+x$ parallel to the incline and $+y$ perpendicular to the incline, both indicated with arrows."
    },
    {
        "index": 996,
        "question": "What is the average speed of the car for the 10 second interval?",
        "subject": "CM",
        "image_path": [
            "images/996_0.png"
        ],
        "img_category": "coordinate_system",
        "vision_relevance": "essential",
        "language": "English",
        "level": 3,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nVelocity-time graph: velocity $v$ (in $\\mathrm{m/s}$) on the vertical axis versus time $t$ (in $\\mathrm{s}$) on the horizontal axis, showing three regions—a constant velocity of $+7\\,\\mathrm{m/s}$ for $0 \\leq t < 3\\,\\mathrm{s}$, a linear decrease from $+7\\,\\mathrm{m/s}$ to $-5\\,\\mathrm{m/s}$ between $t = 3\\,\\mathrm{s}$ and $t = 6\\,\\mathrm{s}$, and a constant velocity of $-5\\,\\mathrm{m/s}$ for $t > 6\\,\\mathrm{s}$."
    },
    {
        "index": 1010,
        "question": "An electron moves at constant non-zero velocity directly between two long straight wires with currents in opposite directions. Ignoring gravity, what are the directions of the magnetic field at the location of the electron?",
        "subject": "EM",
        "image_path": [
            "images/1010_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "optional",
        "language": "English",
        "level": 3,
        "sig_figs": "",
        "caption": "IMAGE 1:\nDiagram showing two long, vertical, parallel conductors carrying currents labeled $I$; the left conductor has current directed downward, the right conductor has current directed upward (arrows indicating current direction). Between the conductors, an electron, labeled $\\mathrm{e}^-$, is shown with a velocity vector $\\vec{v}$ pointing vertically downward."
    },
    {
        "index": 1016,
        "question": "A mass moves along the $x$-axis following the position vs. time graph provided. During what time intervals does the mass have an acceleration of $0 \frac{\\text{m}}{\\text{s}^{2}}$?",
        "subject": "CM",
        "image_path": [
            "images/1016_0.png"
        ],
        "img_category": "coordinate_system",
        "vision_relevance": "essential",
        "language": "English",
        "level": 3,
        "sig_figs": "",
        "caption": "IMAGE 1:\nPosition-time graph showing the position ($\\text{Position (m)}$) versus time ($\\text{Time (s)}$) for an object, with the vertical axis labeled from $-5$ to $5$ meters and the horizontal axis labeled from $0$ to $10$ seconds; a thick black curve represents the object's position as a function of time."
    },
    {
        "index": 1025,
        "question": "A triangular glass prism $(\\text{n}=1.6)$ is immersed in a liquid $(\\text{n}=1.1)$ as shown. A laser light is incident on face $AB$ making an angle of $20^{\\circ}$ with the normal $(N)$. What is the angle that the ray emerging from $AC$ makes with the ground when it leaves $AC$ and strikes the ground?",
        "subject": "OPT",
        "image_path": [
            "images/1025_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "English",
        "level": 3,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA triangular prism with vertices $A$, $B$, and $C$ and apex angles $40^\\circ$ at $A$ and $60^\\circ$ at $B$, made of material with refractive index $n=1.6$, is placed inside a rectangular enclosure with regions of refractive index $n=1.1$ labeled \"ground\" on both sides. The prism is oriented with base $CB$ parallel to the bottom. A red ray enters the prism from the right, incident at face $AB$; the angle of incidence is $20^\\circ$ with respect to the dashed normal (N) at the interface. Arrow directions and all relevant angles and indices are shown."
    },
    {
        "index": 1037,
        "question": "如电图1.19.1 所示，两个固定的均匀带电球面 A 和 B 分别带电 $4 Q$ 和 $Q(Q$ $>0)$ 。两球心之间的距离 $d$ 远大于两球的半径，两球心的连线 $M N$ 与两球面的相交处都开有足够小的孔，因小孔而损失的电量可以忽略不计。一个带负电的质点静止地放置在 A 球左侧某处 $P$ 点，且在 $M N$ 直线上。设质点从 $P$ 点释放后刚好能穿越三个小孔，并通过 B 球球心。试求质点开始时所在的 $P$ 点与 A 球球心的距离 $x$ 应为多少？",
        "subject": "EM",
        "image_path": [
            "images/1037_0.png"
        ],
        "img_category": "charge_distribution",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo charged spheres, $A$ with charge $4Q$ and $B$ with charge $Q$, are positioned along the horizontal dashed line $MN$ with centers separated by distance $d$; point $P$ lies a distance $x$ to the left of sphere $A$ along $MN$, all variables and points ($A$, $B$, $M$, $N$, $P$, $x$, $d$, $Q$) are clearly labeled, with no vectors shown."
    },
    {
        "index": 1075,
        "question": "在如电图4.33.1所示的电容网络中：\n电容值：$C_1=4C_0$，$C_2=2C_0$，$C_3=C_0$；电源电动势$\\mathcal{E}=8$（内阻可忽略）。\n\n操作步骤：\n1. 断开$K_4$，接通$K_1,K_2,K_3$充电\n2. 断开$K_1,K_2,K_3$，接通$K_4$放电\n\n求放电过程中电阻$R$上产生的总热量$Q$。",
        "subject": "EM",
        "image_path": [
            "images/1075_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nSchematic diagram of an electric circuit with a voltage source $\\mathcal{E}$, three capacitors $C_1$, $C_2$, and $C_3$ connected in series, a resistor $R$, and four switches labeled $k_1$, $k_2$, $k_3$, and $k_4$; the circuit shows the arrangement of these components, with all switches, the resistor, and capacitors clearly marked."
    },
    {
        "index": 1080,
        "question": "如电图4.35.1所示，12根电阻均为$R$的电阻丝连接成正六面体（立方体）。在两根电阻丝中连接有电动势分别为$\\mathscr{E}_{1}$和$\\mathscr{E}_{2}$的电源，另5根电阻丝中连接有5个相同的电容器$C$。设电源正、负极之间的距离均可忽略，内阻亦可略，且$\\mathscr{E}_{1}=2I_{0}R$, $\\mathscr{E}_{2}=I_{0}R$。试求：$A^{\\prime}B^{\\prime}$中电容器极板上的电量$Q_{A^{\\prime}B^{\\prime}}$。",
        "subject": "EM",
        "image_path": [
            "images/1080_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA cube with vertices labeled $A$, $B$, $A'$, $B'$, and four additional points $X_1$, $X_2$, $Y_1$, $Y_2$ at the centers of its faces; two batteries with emfs $\\mathcal{E}_1$ (between $X_1$ and $Y_1$) and $\\mathcal{E}_2$ (between $X_2$ and $Y_2$) are placed inside the cube, and six identical capacitors labeled $C$ are connected along the remaining cube edges between adjacent labeled points."
    },
    {
        "index": 1105,
        "question": "如力图 3.33.1 所示，在光滑地面上静止地放着质量为 $m$ 的箱子，在箱内光滑的底面上，质量也为 $m$ 的滑块以水平初速 $v_{0}$ 开始运动，并与两壁反复碰撞，已知滑块与箱子每碰一次后，两者的相对速度改变 $e=4 \\\\sqrt{1 / 2}$ 倍。试求： 最大经几次碰撞后，系统总能量的损耗不大于 $40 \\%$ ？",
        "subject": "CM",
        "image_path": [
            "images/1105_0.png"
        ],
        "img_category": "linear_motion",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "1",
        "caption": "IMAGE 1:\nA block of mass $m$ is placed inside a U-shaped container of mass $m$; the block is initially at rest inside the container, and an arrow labeled $\\vec{v}_0$ points horizontally to the right from the block indicating its initial velocity relative to the container. Both block and container are on a horizontal surface."
    },
    {
        "index": 1135,
        "question": "如力图 7.15 .1 所示，质量为 $m$ 的小球在光滑水平桌面上以角速度 $\\\\omega$ 做匀速圆周运动，所需的向心力由与小球相连的弹簧提供，弹簧的劲度系数为 $k$ ，另一端固定。今沿径向轻击小球，试求小球径向振动的频率，",
        "subject": "CM",
        "image_path": [
            "images/1135_0.png"
        ],
        "img_category": "spring_force",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA mass $m$ is attached to a horizontal spring of force constant $k$, fixed at point $O$; the spring's natural length is $r_0$. The mass moves in a circular path of radius $R$ about $O$, subtending an instantaneous distance $r$ between $O$ and $m$. The mass is shown in motion with angular velocity $\\omega$, indicated by a curved arrow."
    },
    {
        "index": 1139,
        "question": "如力图 7.21 .1 所示，质量为 $M$ ，长为 $L$ 的均匀刚性细杆的一端悬挂，可在铅垂面内绕悬点无摩擦地摆动。质量为 $m=M / 3$ 的小虫相对杆以速度 $v$ 缓慢地沿杆向下爬行，开始时，杆静止并与竖直线夹角为 $\\theta_{0}$（设 $\\theta_{0}$ 很小）；小虫位于杆上端的悬点，放开后，杆开始摆动，小虫开始爬行，试求：小虫爬到杆下端时，杆摆动的幅度。",
        "subject": "CM",
        "image_path": [
            "images/1139_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA uniform rod of mass $M$ pivots about its upper end, inclined at angle $\\theta$ from the vertical; the diagram shows the gravitational force $mg$ acting downward at the center of mass, a tangential friction force $f$ directed up along the rod, and the centripetal force $ml\\dot\\theta^2$ directed from the center of mass toward the pivot."
    },
    {
        "index": 1148,
        "question": "如热图 2.8.1 所示为一固定的直立气缸，它由上，下两个相互连通的圆筒构成。上部圆筒的体积为 $V_{\\mathrm{m}}$ ，其中有一个质量为 $2 m$ ，面积为 $2 S$ 的薄活塞 A。下部圆筒足够长，其中有一个质量为 $m$ ，面积为 $S$ 的活塞 B。两圆筒由一细而短的管道连通，两活塞均可在各自的圆筒内无摩擦地上下滑动，活塞 A 的上方盛有 1 mol 的理想气体，活塞 $\\mathrm{A}, \\mathrm{B}$ 之间盛有某种气体，活塞 B下方与大气连通，开始时整个系统处于平衡态， A 上方理想气体的温度为 $T_{0}$ ，已知该理想气体每摩尔的内能 $U=C T$ ，其中 $C$为常量,$T$ 为热力学温度，活塞 B下方的大气压强为常量 $p_{0}$ ，设气缸壁，管道，活塞均不导热。然后，通过置于上部圆筒顶端的电热丝 $L$ 对活塞 A 上方的气体缓慢加热，设在整个加热过程中传递给 A 上方气体的热量为 $Q_{0}$ 。试问：达到平衡时， A 上方气体的温度 $T_{\\mathrm{f}}$ 是多少？",
        "subject": "TSM",
        "image_path": [
            "images/1148_0.png"
        ],
        "img_category": "thermodynamics",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA schematic cross-section showing a rigid-walled container divided into chambers; chamber A (upper) contains a movable piston and a coil labeled $L$, while chamber B (lower) is separated by another piston exposed to atmospheric air (大气) below; both pistons are drawn horizontally with labeled positions A and B."
    },
    {
        "index": 1183,
        "question": "A collimated beam of light with wavelength $\\lambda_{0}=596 \\mathrm{~nm}$ is normally incident on a diffraction grating DG with the period of grooves $d=3 \\mu \\mathrm{~m}$. The diffraction pattern is observed in the back focal plane of a focusing lens with the focal length $f=100 \\mathrm{~mm}$. Determine the separation $\\Delta x$ between the principal maxima of the diffraction pattern.",
        "subject": "OPT",
        "image_path": [
            "images/1183_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "English",
        "level": 6,
        "sig_figs": "4",
        "caption": "IMAGE 1:\nParallel light rays enter from the left, pass through a diffraction grating labeled \"DG,\" and then through a lens labeled \"L\" with focal length $f$ on both sides, forming separated focal points at a screen where the vertical separation is denoted by $\\Delta x$; arrows indicate the direction of light propagation through the system."
    },
    {
        "index": 1190,
        "question": "A laser beam with wavelength $\\lambda_{0}=0.633 \\mu \\mathrm{~m}$ is diffracted by a phase diffraction grating DG moving with velocity $\\vec{v}$ in its own plane perpendicularly to its grooves. Determine the wavelength of laser beams $\\lambda_{(+2)}$ and $\\lambda_{(-2)}$ diffracted in the orders +2 and -2 , respectively, if the grating period is $d=2 \\mu \\mathrm{~m}$, the grating motion velocity is $|\\vec{v}|=6 \\mathrm{~mm} / \\mathrm{s}$, and the laser beam is normally incident on the grating. Consider the grating as a secondary source of diffracted waves.",
        "subject": "OPT",
        "image_path": [
            "images/1190_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "essential",
        "language": "English",
        "level": 6,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA monochromatic light beam of wavelength $\\lambda_0$ is incident from the left on a diffraction grating labeled \"DG,\" which is moving upward with velocity $\\vec{v}$; outgoing rays are shown at various angles corresponding to diffraction orders labeled $+2$, $+1$, $-1$, and $-2$."
    },
    {
        "index": 1194,
        "question": "Consider the circuit below, which consists of a solenoid, with $n$ turns per length, at the center of, and connected to, a square loop, of side $\\\\ell$. The axis of the solenoid is perpendicular to the plane of the loop. The loop contains a source $\\\\mathcal{E}_{0}(t)$ and a resistor $R$. Find the current that flows if $\\\\mathcal{E}_{0}(t)=\\\\mathcal{E}_{0} \\\\sin (\\\\omega t)$ and is connected at time $t=0$.",
        "subject": "EM",
        "image_path": [
            "images/1194_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 6,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA single-loop electrical circuit containing a time-dependent emf source $\\mathcal{E}_0(t)$, a resistor $R$, and an inductor; the square loop has sides labeled $\\ell$, the current $I$ is shown circulating clockwise through the inductor and resistor by arrows indicating its direction."
    },
    {
        "index": 1195,
        "question": "Consider the loop of wire below with radius $a$ located above a long straight wire carrying a current $I(t)$ with $\\frac{\\mathrm{d} I}{\\mathrm{~d} t}=k$. Find the induced electromotive force (emf) in the loop if its center is positioned $2 a$ above the wire.",
        "subject": "EM",
        "image_path": [
            "images/1195_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 6,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA circular loop of radius $a$ is positioned such that its center is a distance $2a$ vertically above a long straight wire; the straight wire carries a time-dependent current $I(t)$ to the right, as indicated by the rightward vector along the line representing the wire. An arrow marks the radius $a$ of the loop, and a dashed vertical arrow labeled $2a$ denotes the perpendicular separation between the loop’s center and the wire."
    },
    {
        "index": 1208,
        "question": "图示三铰拱受水平力 $\\boldsymbol{P}$ 作用，求支座 $A$ 与 $B$ 的反力．拱架重量不计．",
        "subject": "CM",
        "image_path": [
            "images/1208_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 6,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA rigid frame with supports at points $A$ and $B$ rests on a horizontal base, with each vertical segment of height $d$ and horizontal segments of length $a$ between points; a horizontal force $P$ is applied to the left end of the top segment, and all vector directions, distances ($a$, $d$), and fixed supports are labeled as shown."
    },
    {
        "index": 1214,
        "question": "窗框 $A B$ 重 100 N ，其截面如图所示．框架 $A B$ 可绕水平轴 $A$ 转动．拉动跨过滑轮 $C$ 和 $D$ 的绳子 $B C D$ 可以把窗子打开．滑轮 $C$ 和 $A$ 在同一铅垂线上，滑轮的大小和摩擦均不计，框架的重量作用在其中点．设 $A B=A C$ ，框架 $A B$ 与水平线 $A H$ 的夹角为 $\\varphi$ ，求以 $\\varphi$ 角表示的绳子张力 $T$ ，并求这张力的极大值和极小值．",
        "subject": "CM",
        "image_path": [
            "images/1214_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 6,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA rigid, pivoted linkage system with joints at points $A$, $B$, $C$, $D$, and $H$ is shown. Link $AB$ rotates about the fixed pivot $A$, forming angle $\\varphi$ with the horizontal ground line $HD$. Point $B$ is connected to $C$ by a rigid rod; $C$ and $A$ are constrained to move vertically along fixed tracks. A dashed arc traces the path of $B$ as $AB$ rotates."
    },
    {
        "index": 1228,
        "question": "磁针用细丝水平挂在磁子午面内，地磁两极作用在磁针两极上的水平分力方向相反，大小都等于 0.02 mN ，磁针两极相距 10 cm 。已知扭转细丝 $1^{\\circ}$ 需要力偶矩为 $0.05 \\mathrm{mN} \\cdot \\mathrm{cm}$ ．使磁针与磁子午面成 $30^{\\circ}$ 角，需将细丝扭转几度？",
        "subject": "CM",
        "image_path": [
            "images/1228_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 6,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nThe diagram shows a crane system mounted on a base $EF$, with a vertical support pivot at $B$, a horizontal arm $DC$ of length $4\\,\\text{m}$ extending from $D$, and a mass suspended from $C$. The point $D$ is $0.8\\,\\text{m}$ above $B$. A vector labeled $A$ points tangentially at the base pivot $B$. The spatial arrangement includes points $E$, $F$, $B$, $A$, $D$, and $C$, with connecting beams and a hanging load at $C$; all structural elements and distances are indicated."
    },
    {
        "index": 1268,
        "question": "如图所示，两个均匀的带电球面 $A$ 和 $B$ ，分别带电 $4 Q$ 和 $Q(Q>0)$ 。两球心之间的距离 $d$ 远大于两球半径，经过两球心的直线 $M N$ 与两球面相交处都开有足够小的孔，因小孔而损失的电量可略。一带负电的质点静止地放在 $A$ 球面左侧某处 $P$ 点，且在 $M N$ 直线上。设质点从 $P$ 静止释放后可以穿过三个孔，且刚好能到达或通过 $B$ 的球心。试求质点初始位置到 $A$ 球心的距离 $x$ 。",
        "subject": "EM",
        "image_path": [
            "images/1268_0.png"
        ],
        "img_category": "charge_distribution",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo charged spheres, labeled $A$ (charge $4Q$) and $B$ (charge $Q$), are aligned horizontally along line $MN$. The center-to-center distance between sphere $A$ and $B$ is labeled $d$. Point $P$ lies to the left of sphere $A$, and the distance from $P$ to $A$ is labeled $x$. The horizontal arrangement $M$–$P$–$A$–$B$–$N$ is illustrated, with all components and distances labeled."
    },
    {
        "index": 1278,
        "question": "如图所示，自由长度 $L$ 足够长，劲度系数为 $k$ 的轻弹簧，两端系两小球 1 和 2 ，球 1 的质量为 $m_{1}$ ，电量为 $Q_{1}\\big(Q_{1}>0\\big)$ ，球 2 的质量为 $m_{2}$ ，电量为 $Q_{2}\\big(Q_{2}>0\\big)$ 。弹簧与小球都在匀强电场中，场强 $E$ 的方向与球 1 到球 2 连线的方向一致。开始时，弹簧为自由长度状态，两小球静止。设两小球之间的电相互作用可略，试求此后两小球之间的最大距离。",
        "subject": "CM",
        "image_path": [
            "images/1278_0.png"
        ],
        "img_category": "spring_force",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo point masses, $m_1$ (with charge $Q_1$), labeled 1, and $m_2$ (with charge $Q_2$), labeled 2, are connected by a spring of spring constant $k$ and natural length $L$; the system is situated between and parallel to two uniform electric fields, both represented by arrows labeled $\\vec{E}$ pointing to the right."
    },
    {
        "index": 1280,
        "question": "如图所示，在螺旋环的平均半径 $R$ 处有点源 $P$ ，从 $P$ 点沿磁力线方向注入小孔径 $2 \\alpha_{0}\\left(\\alpha_{0} \\ll 1^{\\circ}\\right)$ 的电子束，束中电子都是经电压 $U_{0}$ 加速后从 $P$ 点发出的。设螺旋环中磁场 $\\boldsymbol{B}$ 的大小为常量，电子束中各电子间的相互作用可以忽略。为了解使电子束沿环形磁场运动，需要另外加一个使电子束偏转的均匀磁场 $\\boldsymbol{B}_{1}$ ，对于在环内沿半径为 $R$ 的圆形轨道运动的一个电子，试计算所需的 $\\boldsymbol{B}_{1}$ 的大小。",
        "subject": "EM",
        "image_path": [
            "images/1280_0.png"
        ],
        "img_category": "capacitance_resistance",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA circular path of radius $R$ is shown, with a point $P$ on the path where an angle $2\\alpha_0$ is marked between two dashed path segments; arrows along the dashed curve indicate counterclockwise motion around the circle."
    },
    {
        "index": 1281,
        "question": "如图所示，电磁铁的两极是长方形平面，其长度 $L$ 远大于两极的间距。在两极之间除边缘外，磁感应强度 $\\boldsymbol{B}_{0}$ 为常矢量，边缘部分的磁场线有所弯曲。取 $O x y z$ 坐标系，$z$ 轴为两极之间的中央轴，$y z$ 平面为两极之间的中分面，$x y$ 平面是磁铁的左侧面，$x$ 轴与 $\\boldsymbol{B}$ 的方向一致。一个电量为 $q>0$ 的带电粒子，从 $x$ 轴的 $x_{0}$ 处（ $x_{0}$ 的绝对值远小于两极间距）以平行 $z$ 轴的初始动量 $p_{0}\\big(p_{0} \\ggg q B_{0} L\\big)$ ，从磁铁两极的左侧面射入场区。在 $x$ 轴上取一段直线 $x_{0} \\geq x \\geq-x_{0}$ ，假设有一束粒子（电量均为 $q$ ，初始动量均为 $p_{0}$ ）从该段直线上各点射入场区，忽略粒子间的相互作用，试证明这些粒子将近似地会聚在 $z$轴的某一点上，该点与磁铁右侧面的间距称为焦距 $f$ ，试导出 $f$ 的近似表达式。",
        "subject": "EM",
        "image_path": [
            "images/1281_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo parallel ferromagnetic plates (labeled \"磁铁\") are separated by a distance with length $L$, creating a uniform magnetic field $\\vec{B}_0$ pointing vertically upward between them; a coordinate system $(x, y, z)$ is shown with origin $O$, and initial values $x_0$ and momentum $\\vec{p}_0$ are marked along the $x$-axis."
    },
    {
        "index": 1286,
        "question": "用七根相同的导体棒连接成的日字形闭合框架如图所示，框架中两个正方形区域内分别有匀强磁场，且有\n$$\n\\left.\\boldsymbol{B}_{\\text {左 }}=-\\boldsymbol{B}_{\\text {右 }}, B_{\\text {左 }}=B_{\\text {右 }}=B, \\frac{\\mathrm{~d} B}{\\mathrm{~d} t}=k \\text { (正的常量 }\\right) .$$\n\n已知每根导体棒长为 $a$ ，电阻为 $R$ 。\n（1）试求图中 $A$ 点到 $B$ 点的电压 $U_{A B}$ 。",
        "subject": "EM",
        "image_path": [
            "images/1286_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nRectangular region $xyCD$ is divided into two adjacent areas $xyAB$ and $ABCD$, each labeled with a uniform magnetic field: $B_{\\mathrm{in}}$ (represented by dots, directed out of the page) in $xyAB$, and $B_{\\mathrm{out}}$ (represented by crosses, directed into the page) in $ABCD$; the boundary $AB$ separates these two magnetic field regions."
    },
    {
        "index": 1294,
        "question": "下图所示的电阻丝网络含有 $N \\geqslant 3$ 个正方形，网络中每一小段电阻为 $R$ ，试求 $A, B$ 间的等效电阻 $R_{A B}$ 。",
        "subject": "CM",
        "image_path": [
            "images/1294_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nDiagram shows a linear sequence of $N$ adjacent blocks labeled $1,\\,2,\\,\\ldots,\\,N-1,\\,N$, arranged horizontally from left to right. The path is bounded by points $A$ (at the leftmost edge of block 1) and $B$ (at the rightmost edge of block $N$); a dashed line separates block 2 and block $N-1$, indicating a partition or gap between them."
    },
    {
        "index": 1305,
        "question": "如图所示，一个无限内接正方形金属丝网络是由一种粗细一致，材料相同的金属丝构成的，其中每一个内接正方形的顶点都在外侧正方形四边中点上。已知与最外侧正方形边长相同的同种金属丝的电阻为 $R_{0}$ ，试求网络中 $A, C$ 两端间等效电阻 $R_{A C}$ 。",
        "subject": "CM",
        "image_path": [
            "images/1305_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nFour concentric squares are shown: the largest has vertices labeled $A$, $B$, $C$, $D$; the next has $E$, $F$, $G$, $H$; the third has $H$, $I$, $F$, $G$ (with $H$ and $I$ at the top and bottom midpoints of the second square); and the smallest, centered, is drawn with dashed lines. Solid lines connect corresponding vertices of neighboring squares, and all squares are oriented at 45-degree offsets relative to each other."
    },
    {
        "index": 1334,
        "question": "如图所示，光源 $S$ 向全反射体 $S^{\\prime}$ 发射一束平行光，发光功率为 $P_{0}$ 。设 $S^{\\prime}$ 以匀速 $v$沿其法线方向朝 $S$ 运动，试求 $S$ 接收到的反射光功率 $P$ 。",
        "subject": "OPT",
        "image_path": [
            "images/1334_0.png"
        ],
        "img_category": "relativity_gravity",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA vertical wall labeled $S'$ moves to the right with velocity $\\vec{v}$ (rightward arrow), while a light pulse (labeled with 光束, \"light beam\") with energy flux $\\vec{S}$ propagates toward the left (leftward arrow) toward the wall."
    },
    {
        "index": 1339,
        "question": "动态平行的相对性。三个惯性系 $S, S^{\\text{prime}}, S^{\\text{prime prime}}$ 如图所示，其中 $S^{\\text{prime}}$ 系沿 $S$ 系的 $x$ 轴以匀速度 $v$ 相对 $S$ 系运动，$x^{\\text{prime}}$ 轴与 $x$ 轴重合，$y^{\\text{prime}}$ 轴与 $y$ 轴平行。$S^{\\text{prime prime}}$ 系沿 $S^{\\text{prime}}$ 系的 $y^{\\text{prime}}$ 轴以匀速度 $v$ 相对 $S^{\\text{prime}}$ 系运动，$y^{\\text{prime prime}}$ 与 $y^{\\text{prime}}$轴重合，$x^{\\text{prime prime}}$ 轴与 $x^{\\text{prime}}$ 轴平行。三个坐标系的原点 $O, O^{\\text{prime}}, O^{\\text{prime}}$ 重合时，设定 $t=t^{\\text{prime}}=t^{\\text{prime prime}}=0$ 。定量导出 $x^{\\text{prime prime}}$ 轴在 $S$ 系中的投影线方程，若为直线，进而确定其斜率。",
        "subject": "CM",
        "image_path": [
            "images/1339_0.png"
        ],
        "img_category": "relativity_gravity",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nThree Cartesian coordinate systems—$S$ with origin $O$ and axes $x, y$; $S'$ with origin $O'$ and axes $x', y'$; and $S''$ with origin $O''$ and axes $x'', y''$—are shown. Frames $S'$ and $S''$ move relative to $S$ along the $x$-axis and $y$-axis, respectively, both with speed $v$. Coordinate axes and the directions of velocities are indicated by arrows and labeled accordingly."
    },
    {
        "index": 1344,
        "question": "足够高的桌面上开一小孔，长 $L$ ，质量 $M$ 的均匀细杆坚直穿过小孔，一半在孔的上方。细杆下端有一质量 $m<M$ 的小虫，小虫正下方的地面上有一支点燃的蜡烛，如图所示。设开始时细杆，小虫均处于静止状态，而后在系统自由释放后的瞬间，小虫以相对细杆恒定的速度 $v$ 向上爬行，且在到达小孔前始终未离开杆。小虫为避免被蜡烛烧伤，$v$ 可取的最小值 $v_{0}$ 多大？",
        "subject": "CM",
        "image_path": [
            "images/1344_0.png"
        ],
        "img_category": "relativity_gravity",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA small mass $m$ is suspended from the ceiling by a vertical, rigid, massless rod of total length $L$ made of two segments, each of length $L/2$; above the rod and mass are two horizontal platforms of mass $M$ each. Beneath the suspended mass is a lit candle placed on the floor."
    },
    {
        "index": 1347,
        "question": "A uniform soft rope with mass $ M $ and length $ L $ is initially in the state shown in Figure 1. If end $ A $ detaches and falls in the intermediate state, determine the time $ t $ it takes for the entire rope to become fully straight as shown in Figure 3.",
        "subject": "CM",
        "image_path": [
            "images/1347_0.png",
            "images/1347_1.png",
            "images/1347_2.png"
        ],
        "img_category": "relativity_gravity",
        "vision_relevance": "optional",
        "language": "English",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA uniform rod of total length $L$ hangs vertically from a fixed horizontal support, with its upper ends labeled $A$ and $B$ attached to the support; each segment from $A$ to the midpoint and $B$ to the midpoint is marked as $L/2$. No forces or additional objects are depicted."
    },
    {
        "index": 1349,
        "question": "如图所示，不可伸长的轻绳跨搭在半径为 $R$ 的滑轮上，绳与滑轮间的摩擦因数为 $\nu$ ，滑轮固定不动。绳的左，右侧下端分别连接质量为 $M, m$ 的两个物块，且有 $M>m$ 。将系统从静止自由释放后，在(1)问所得的 $M$ 取值范围内，试求与滑轮接触的半圆绳段中滑轮法向支持力的线密度 $n(n=\\text{d} N / \\text{d} l)$ 随图示 $\\theta$ 角变化的函数关系。",
        "subject": "CM",
        "image_path": [
            "images/1349_0.png"
        ],
        "img_category": "relativity_gravity",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA pulley of radius $R$ is suspended from a fixed support, with two blocks of masses $M$ and $m$ hanging from either side by a massless string passing over the pulley. The angle $\\theta$ is measured between the radius to the right string and the horizontal, which is labeled as \"水平线\" (horizontal line). Directions of $R$ and $\\theta$ are indicated by arrows, and the positions of $M$, $m$, and the strings are clearly shown."
    },
    {
        "index": 1370,
        "question": "将一条边 $A B_{1}$ 的长度等于（1）向所给 $L_{A B}$ ，另一条边 $A B_{2}$ 的长度等于（1）问所得 $L_{B C}$ 的长方形闭合细管道 $A B_{1} C B_{2}$ ，如图 2 所示悬挂在坚直平面内，上端点 $A$ 和下端点 $C$ 固定，对角线 $A C$ 处于坚直方位。 $t=0$ 时刻，将球 1,2 同时从 $A$ 端静止释放。球 1 沿 $A B_{1} C$ 通道到达 $C$端时刻记为 $T_{1}$ ，球 2 沿 $A B_{2} C$ 通道到达 $C$ 端时刻记为 $T_{2}$ ，试求 $T_{1}: T_{2}$ 。",
        "subject": "CM",
        "image_path": [
            "images/1370_0.png",
            "images/1370_1.png",
            "images/1370_2.png"
        ],
        "img_category": "relativity_gravity",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA right triangle $ABC$ is shown with vertices labeled $A$, $B$, and $C$; sides $AB$ and $AC$ are labeled $1$ and $2$ respectively near vertex $A$. A vertical arrow labeled $\\vec{g}$ points downward, indicating the direction of gravitational acceleration."
    },
    {
        "index": 1404,
        "question": "A light rod of length $l$ with a small ball of mass $m$ attached to its upper end can rotate freely without friction around its lower end fixed at point $O$ in space. A vertical $z$-axis is drawn upward from point $O$. Initially, the rod makes an angle $\\theta_0$ ($\\theta_0 > 0$) with the $z$-axis, and the ball has an initial velocity $v_0$ that is horizontal and perpendicular to the rod, as shown in Figure 1. The $Oxy$ coordinate plane represents a horizontal geometric plane (not a physical table or ground but a plane through which the rod can pass). During the motion, the velocity $v$ of the ball remains perpendicular to the rod and can be orthogonally decomposed into a horizontal component $v_{/\\text{}}$ and a remaining component $v_\\perp$ within the plane perpendicular to the rod. Determine the value of $\\cos \\theta$ when $v_{\\perp}=0$;",
        "subject": "CM",
        "image_path": [
            "images/1404_0.png",
            "images/1404_1.png",
            "images/1404_2.png"
        ],
        "img_category": "linear_motion",
        "vision_relevance": "essential",
        "language": "English",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA particle of mass $m$ is attached at point $O$ to a massless rod of length $l$, forming an angle $\\theta_0$ with the vertical $z$-axis; the $Oxyz$ coordinate system is shown. The initial velocity vector $\\vec{v}_0$ (into the page, symbol ⊗) is perpendicular to the section $Om$. The gravitational acceleration $\\vec{g}$ points downward along the $z$-axis."
    },
    {
        "index": 1405,
        "question": "如图所示，均匀金属丝绕成正截面圆半径为 $R$ ，螺距为 $H$ 的等距螺旋线，两端用质量可略，长为 $R$ 的杆固定在坚直固定转轴上，转轴与螺旋线中央轴重合。金属丝上穿着一个小球 $P$ ，金属丝与小球的质量同为 $m$ 。开始时 $P$ 在最高点，静止释放后，沿金属丝下滑，金属丝绕轴旋转。设系统处处无摩擦，试求 $P$ 降落高度 $h$ 时，受金属丝的合作用力大小 $N$ 。",
        "subject": "CM",
        "image_path": [
            "images/1405_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA helical path of radius $R$ and pitch $H$ is wound around a straight vertical axis; the point $P$ is located on the helix, and dimensions $R$ and $H$ are indicated with arrows."
    },
    {
        "index": 1406,
        "question": "长 $l$ 的轻杆两端连接质量同为 $m$ 的小球，开始时直立在光滑水平地面上，而后，用水平恒力 $\\boldsymbol{F}$ 拉动着地小球，试求轻杆与竖直方向夹角为右图所示锐角 $\\boldsymbol{\\theta}$ 时，地面提供的支持力大小 $N$ 。",
        "subject": "CM",
        "image_path": [
            "images/1406_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA uniform rod of mass $m$ and total length $l$ is shown with one end resting on a rough horizontal surface and the other end elevated. The center of mass $C$ is marked at the midpoint ($l/2$ from either end). A normal force $\\vec{N}$ acts vertically upward at the lower end, and an external horizontal force $\\vec{F}$ acts to the right at the same end. The rod is labeled with its length segments and all forces are represented as vectors with their directions indicated."
    },
    {
        "index": 1424,
        "question": "如图所示，水平桌面上有 10 个质量同为 $m$ 的静止小木块沿直线放置，相邻两个小木块的间距同为 $l$ ，每个小木块的线度可略，各自与桌面间的摩擦系数同为 $\\mu$ 。以水平恒力 $\\boldsymbol{F}$ ，沿小木块排列方向推动第 1 个小木块，而后与前方的小木块相继发生完全非弹性碰撞，力 $\\boldsymbol{F}$ 始终作用着，当到达第 10 个小木块的侧面时，前 9 个小木块刚好停住，未能发生碰撞。将小木块 $1, ~ 2, ~ \\cdots 9$ 一起构成的系统作为讨论的对象，试求过程中\n系统曾经有过的最大动能 $E_{\\text {kmax }}$ 。",
        "subject": "CM",
        "image_path": [
            "images/1424_0.png"
        ],
        "img_category": "linear_motion",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "4",
        "caption": "IMAGE 1:\nTen blocks labeled $1$ through $10$, each separated by a distance $l$, are lined up on a horizontal frictionless surface; a horizontal force $\\vec{F}$ is applied to block $1$ to the right."
    },
    {
        "index": 1435,
        "question": "每边长 76 cm 的密封均匀正方形导热细管按图 1 所示直立在水平地面上，稳定后，充满上方 $A B$ 管内的气体的压强 $p_{A B}=76 \\text{cmHg}$ ，两侧 $B C$ 管和 $A D$ 管内充满水银，此时下方 $A D$ 管内也充满了某种气体。不改变环境温度，将此正方形细管按图 2 所示倒立放置，稳定后试求 $A B$ 管内气体柱的长度 $l_{A B}$ 。(用计算器二分逼近法给出 3 位有效数字。)",
        "subject": "TSM",
        "image_path": [
            "images/1435_0.png",
            "images/1435_1.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA rigid square loop is placed inside a square-shaped frame labeled $ABCD$, where $AB$ is the top, $BC$ is the right, $CD$ is the bottom (on a horizontal surface), and $DA$ is the left side. The diagram shows sections of coils or wires (indicated by dotted lines) along the vertical sides $AD$ and $BC$ of the outer frame. No forces, currents, or vector directions are depicted."
    },
    {
        "index": 1458,
        "question": "如图所示，金属杆 $A B$ 以 $3 \\mathrm{~m} / \\mathrm{s}$ 的速度匀速平行于一长直导线移动，此导线通有电流 2 A ，金属杆的长度及与直导线的相对位置如图所示，则此杆中的感应电动势的大小为 $\\qquad$。",
        "subject": "EM",
        "image_path": [
            "images/1458_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA long, straight vertical wire carries current $I$ upwards; point $O$ marks its position. A conducting rod $AB$ of length $1.0\\,\\mathrm{m}$ lies horizontally along the $x$-axis at a distance $0.1\\,\\mathrm{m}$ from the wire, with $A$ at $x=0.1\\,\\mathrm{m}$ and $B$ at $x=1.1\\,\\mathrm{m}$. The rod moves with velocity $\\vec{v}$ perpendicular to itself (parallel to the positive $y$-axis), and a differential segment $\\mathrm{d}x$ is marked along $AB$."
    },
    {
        "index": 1462,
        "question": "如图所示，有两根无限长平行直导线，通以大小相等，方向相反的电流，且以 $\\frac{\\mathrm{d} I}{\\mathrm{~d} t}$ 的变化率增长。若有一矩形线圈与之共面，求：任一时刻通过线圈的磁通量；",
        "subject": "EM",
        "image_path": [
            "images/1462_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nThe diagram shows a rectangular current-carrying conductor of width $l$ and length $a$, positioned with one side at a distance $d$ from point $O$ on a long straight conductor carrying current $I$; the horizontal distance from $O$ to an arbitrary vertical slice of the rectangle is $x$, and the slice has thickness $dx$; the perpendicular distance between the two conductors is labeled as $b$; all relevant lengths and currents are labeled as indicated, and the positive $x$-axis is shown pointing to the right."
    },
    {
        "index": 1463,
        "question": "如图所示，有两根无限长平行直导线，通以大小相等，方向相反的电流，且以 $\\frac{\\mathrm{d} I}{\\mathrm{~d} t}$ 的变化率增长。若有一矩形线圈与之共面，求：线圈中的感生电动势。",
        "subject": "EM",
        "image_path": [
            "images/1463_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA rectangular wire loop of width $a$ and length $l$ is positioned parallel to the $x$-axis at coordinate $x$, with an infinitesimal segment $dx$ indicated at its right edge; the loop is placed next to a vertical region of uniform current $I$ flowing upward within a shaded strip of width $b$, extending from $x=0$ to $x=d$, with all distances and motion referenced along the $x$-axis as labeled."
    },
    {
        "index": 1479,
        "question": "At normal brightness, the p.d. across the lamp is 8.0 V .\nCalculate, for normal brightness,\nthe resistance of the lamp,",
        "subject": "EM",
        "image_path": [
            "images/1479_0.png"
        ],
        "img_category": "coordinate_system",
        "vision_relevance": "essential",
        "language": "English",
        "level": 1,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nGraph showing the relationship between current ($I$, in A) on the vertical axis and potential difference (p.d., $V$ in V) on the horizontal axis for a filament lamp, with data points plotted as a continuous curve."
    },
    {
        "index": 1482,
        "question": "Five of these lamps, operating at normal brightness, are connected in parallel to a power supply.\n\nDetermine\nthe current from the power supply.",
        "subject": "EM",
        "image_path": [
            "images/1482_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "optional",
        "language": "English",
        "level": 1,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA schematic diagram showing five identical light bulbs connected in parallel, each with its own branch, to a power supply; all bulb symbols are arranged vertically, and the circuit is controlled by a single switch located at the top right."
    },
    {
        "index": 1487,
        "question": "Fig. 8.1 shows a source $E$ of e.m.f. 60 V in a circuit.\n\nThe heater H has a resistance of $22.5 \\Omega$ and the potential difference (p.d.) across it is 45 V . Calculate:\nthe current in the $10 \\Omega$ resistor.",
        "subject": "EM",
        "image_path": [
            "images/1487_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 1,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nThe circuit diagram shows a battery or emf source labeled $E$, a parallel combination of two resistors (one labeled $10\\,\\Omega$ and the other labeled $X$), and a component labeled $H$ in series with the parallel network. All components are connected in a single closed loop, with each symbol clearly indicated. No current or voltage vectors are depicted."
    },
    {
        "index": 1507,
        "question": "用两个相同的电热器给质量同为 2 kg 的物质甲和水加热，它们的温度随时间的变化关系如图1－3 所示，据此判断甲物质 10 min 吸收的热量为多少？",
        "subject": "TSM",
        "image_path": [
            "images/1507_0.png"
        ],
        "img_category": "coordinate_system",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 1,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nTemperature vs. time graph with the vertical axis labeled $T\\,/\\,^\\circ\\mathrm{C}$ and the horizontal axis labeled $t\\,/\\,\\mathrm{min}$; two straight lines originate from the origin, one labeled \"甲\" reaching $80^\\circ\\mathrm{C}$ at $10\\,\\mathrm{min}$, and one labeled \"水\" reaching $60^\\circ\\mathrm{C}$ at $20\\,\\mathrm{min}$, representing the temperature rise of two substances over time."
    },
    {
        "index": 1546,
        "question": "如图所示，一绳索跨过无摩擦的滑轮，系在质量为 1.00 kg 的物体上，起初物体静止在无摩擦的水平平面上。若用 5 N 的恒力作用在绳索的另一端，使物体向右作加速运动，当系在物体上的绳索从与水平面成 $30^{\\circ}$ 角变为 $37^{\\circ}$ 角时，力对物体所做的功为 $\\\\qquad$ （已知滑轮与水平面之间的距离 $d=1.00 \\mathrm{~m}$ 。",
        "subject": "CM",
        "image_path": [
            "images/1546_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA block rests on a horizontal surface and is attached to a light string that passes over a frictionless pulley fixed to the ceiling; the string exerts a force of $5\\,\\mathrm{N}$ downward at height $E$ above the ground. The block’s motion and string directions are marked by two dashed lines making $30^\\circ$ and $37^\\circ$ angles with the horizontal, respectively. The force vector $5\\,\\mathrm{N}$ points vertically downward. All relevant angles and distances are labeled."
    },
    {
        "index": 1558,
        "question": "The $\neta^{\nprime}$ meson (let $M$ denote its mass) can decay into a $\nrho^{0}$ meson (mass $m$ ) and a photon (mass $=0$ ): $\neta^{\nprime} \nrightarrow \nrho^{0}+\ngamma$. The decay is isotropic in the rest frame of the parent $\neta^{\nprime}$ meson. Now suppose that a monoenergetic beam of $\neta^{\nprime}$ mesons is traveling with speed $v$ in the laboratory and let $\ntheta$ be the angle of the photon relative to the beam, as shown in Fig. 4.5. Let $P(\ntheta) d(\ncos \ntheta)$ be the normalized probability that $\ncos \ntheta$ lies in the interval $(\ncos \ntheta, \ncos \ntheta+d \ncos \ntheta)$. Compute $P(\ntheta)$.",
        "subject": "AMONP",
        "image_path": [
            "images/1558_0.png"
        ],
        "img_category": "feynman_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 7,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA particle labeled $\\eta'$ moves horizontally with velocity $\\vec{v}$ to the right and at a vertex splits into two products: a photon ($\\gamma$) and a $\\rho^0$ particle, both emerging from the same point at an angle $\\theta$ between their trajectories, as indicated by their arrows; $\\theta$ is explicitly marked between the exits of $\\gamma$ and $\\rho^0$."
    },
    {
        "index": 1562,
        "question": "如电图 1.43.1 所示，金属球壳上方与一个带有两个活栓的细长玻璃管连接，管壁外包着金属箔，金属箔与电池组的接地端连通，管上方槽中的水银则与电池组另一端正极连通，开始时，球内无水银且不带电，玻璃管下端的活栓关闭，上端的活栓打开，管内充满水银，然后，关闭上端活栓，移开金属箔，再打开下端活栓，使管内水银注入球内，不断重复此过程，直至球内充满水银为止。设电池组的端电压为 $V$ ，玻璃的相对电容率（又称介电常量）为 $\\varepsilon_{r}$ ，管半径为 $r$ ，管壁厚度为 $d$ ，球半径为 $R$ ，且有 $R \\gg r \\gg d$ 。试近似计算金属球壳充满水银后相对于地的电势，",
        "subject": "EM",
        "image_path": [
            "images/1562_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA conducting sphere of radius $R$ is electrically connected via a vertical conducting rod dipped in mercury (labeled “Hg”) contained in a horizontal vessel; the rod is attached to an external circuit with a voltage source and ground as shown, illustrating an electrical path from the sphere, through the rod and mercury, to the battery."
    },
    {
        "index": 1563,
        "question": "电流均匀地流过宽为 $b$ 的无限长平面导体薄板，电流为 $I$，沿板长方向流动。求：通过板的中线并与板面垂直的直线上一点 $Q$ 处的磁感应强度，$Q$ 点到板面的距离为 $x$［见习题 8－15 图（b）］。",
        "subject": "EM",
        "image_path": [
            "images/1563_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA rectangular conducting strip of width $b$ carries a current $I$ directed upward, as shown in (a). Point $P$ is located at a distance $b$ from the edge of the strip. Diagram (b) provides a top view, indicating the strip's width $b$, the centerline, and the location of the current $I$ (perpendicular to the page). Point $Q$ lies on the $x$-axis at distance $x$ from the strip, while the strip edges are at $x = -\\frac{b}{2}$ and $x = \\frac{b}{2}$. All vectors and points are explicitly marked."
    },
    {
        "index": 1566,
        "question": "A boat of mass $M$ is floating in a (deep) tank of water with vertical sidewalls. A rock of mass $m$ is dropped into the boat. How much does the water level in the tank rise?",
        "subject": "CM",
        "image_path": [
            "images/1566_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nU-tube with two vertical arms of cross-sectional areas $A_1$ (left) and $A_2$ (right), with the left column’s liquid height above the base marked as $d$; no liquid, force, or flow is explicitly shown."
    },
    {
        "index": 1581,
        "question": "In Fig. 2.68 a block of semiconductor (conductivity $=\\sigma$ ) has its bottom face $(z=0)$ attached to a metal plate (its conductivity $\\sigma\\rightarrow\\infty$) which is held at potential $\\phi=0$. A wire carrying current $J$ is attached to the center of the top face $(z=c)$. The sides $(x=0, x=a, y=0, y=b)$ are insulated and the top is insulated except for the wire. Assume that the charge density is $\\rho=0$ and $\\varepsilon=\\mu=1$ inside the block. (a) Write down the equations satisfied by the potential inside the box and the general solution for the potential.",
        "subject": "EM",
        "image_path": [
            "images/1581_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA rectangular box with edges labeled $a$, $b$, and $c$ is oriented with one face lying on the $xy$-plane at $\\phi = 0$; axes $x$, $y$, and $z$ are shown, and a current density vector $\\vec{J}$ is depicted pointing in a positive direction within the $yz$-plane."
    },
    {
        "index": 1588,
        "question": "如力图 3.13.1 所示，半径为 $R$ 的光滑圆环绕坚直的直径轴以角速度 $\\\\omega$ 旋转。一质量为 $m$ 的小球串在圆环上，可沿环无摩擦地滑动，试求小球的平衡位置，并讨论平衡的稳定性。",
        "subject": "CM",
        "image_path": [
            "images/1588_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA particle of mass $m$ is positioned on the circumference of a circle of radius $R$, centered at point $O$. The particle is at position vector $\\vec{r}$ forming angle $\\theta$ with a reference radius. The circle rotates counterclockwise about a vertical dashed axis through $O$ with angular velocity $\\omega$. A force $\\vec{F}_i$ acting horizontally outward from the center is applied at $m$. All labels ($m$, $O$, $R$, $r$, $\\theta$, $\\omega$, $\\vec{F}_i$) are indicated."
    },
    {
        "index": 1597,
        "question": "如图所示为麦克斯韦滚摆，转盘的质量为 $m$ ，半径为 $R$ ，盘轴的半径为 $r$ ，质量略去不计。求下降时的加速度。",
        "subject": "CM",
        "image_path": [
            "images/1597_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA uniform horizontal rod of length $2R$ is suspended by two vertical strings attached at its ends to a fixed support; a vertical wall passes through the rod's midpoint, allowing frictionless contact. Distances $r$ and $2R$ mark the segments from the wall to the left end and from the wall to the right end of the rod, respectively; all lengths and vertical forces act as labeled, with the wall oriented perpendicular to the rod."
    },
    {
        "index": 1602,
        "question": "如力图3．25．1 所示，台阶每级的宽和高均为 $l$ 。一小球向下逐级弹跳，每次反弹后，相对本级达到的最高高度均为 $H$ ，每次的下落点均在各级的同一地点，已知小球与台阶碰撞时的恢复系数为 $e$ ，忽略空气阻力，试求：$H$ 为多少？",
        "subject": "CM",
        "image_path": [
            "images/1602_0.png"
        ],
        "img_category": "projectile_motion",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nThree stepped platforms each of width $l$ and height $l$ are arranged vertically, with parabolic projectile trajectories drawn between consecutive platforms; the coordinates $x$ and $y$ are shown, as well as height $H$ above point $O$. Dashed lines mark $l$, $H$, and the vertical passing through $O$."
    },
    {
        "index": 1604,
        "question": "Consider the track below, which consists of two parallel conducting rails, separated by a distance $\\ell$, and two metal bars of mass $m$; all of which is in a magnetic field $B$ pointing into the page. Initially, the right bar (bar 2), which has resistance $R$, is held in place, while the left bar (bar 1) is moving towards bar 2 with velocity $v_{0}$. At time $t=0$, both bars are allowed to move freely. Find the minimum distance $d$ between the bars at time $t=0$ such that the bars will not collide.",
        "subject": "EM",
        "image_path": [
            "images/1604_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 6,
        "sig_figs": "",
        "caption": "IMAGE 1:\nCaption:  \nTwo identical conducting rods of mass $m$ labeled 1 and 2 are placed vertically and connected by horizontal rails of length $\\ell$, separated by a horizontal distance $d$. Rod 2 is connected to a resistor $R$. Rod 1 moves to the right with velocity $V_0$. A uniform magnetic field $\\vec{B}$ points into the page (denoted by $\\otimes~\\vec{B}$) and permeates the region between the rods. All vectors and distances ($V_0$, $d$, and $\\ell$) are indicated by arrows within the diagram."
    },
    {
        "index": 1616,
        "question": "Water powered machine. A self-contained machine only inputs two equal steady streams of hot and cold water at temperatures $T_{1}$ and $T_{2}$. Its only output is a single high-speed jet of water. The heat capacity per unit mass of water, $C$, may be assumed to be independent of temperature. The machine is in a steady state and the kinetic energy in the incoming streams is negligible. What is the speed of the jet in terms of $T_{1}, T_{2}$ and $T$, where $T$ is the temperature of water in the jet?",
        "subject": "TSM",
        "image_path": [
            "images/1616_0.png"
        ],
        "img_category": "thermodynamics",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA thermodynamic control volume is shown with two heat inflows $T_1$ and $T_2$ (arrows entering from the left) and an outgoing jet indicated by $T$ (arrow directed outward to the right)."
    },
    {
        "index": 1642,
        "question": "为了实时检测纺织品，纸张等材料的厚度（待测材料可视作相对电容率为 $\\varepsilon_{\\mathrm{r}}$ 的电介质），通常在生产流水线上设置如图所示的传感装置，其中 $\\mathrm{A}, ~ \\mathrm{B}$ 为平板电容器的导体极板，$d_{0}$ 为两极板间的距离，如果要检测钢板等金属材料的厚度，结果又将如何？",
        "subject": "EM",
        "image_path": [
            "images/1642_0.png"
        ],
        "img_category": "capacitance_resistance",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA conducting strip moves horizontally over a flat surface supported by rollers; a rectangular loop labeled $S$ is positioned on the strip, with its two sides labeled $A$ and $B$. Points $A$ and $B$ are shown along the width of the strip, separated by a distance $d$. Perpendicular to the strip at $A$ and $B$ is a downward-pointing vector (possibly a magnetic field). The length $d_0$ marks the distance from the edge of the conducting strip to the roller located nearest to point $A$."
    },
    {
        "index": 1658,
        "question": "在半径为 $a$，电荷体密度为 $\\rho$ 的均匀带电球内，挖去一个半径为 $b$ 的小球，$OO'=c$，如图所示。试求：$O^{\\prime}$ 点的电场强度。$O, ~ O^{\\prime}, ~ P, ~ P^{\\prime}$ 在一条直线上。",
        "subject": "EM",
        "image_path": [
            "images/1658_0.png"
        ],
        "img_category": "charge_distribution",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nDiagram shows two concentric circles of radii $R$ (center $O$) and $r$ (center $O'$) with $O'$ displaced from $O$; points $P$ and $P'$ are marked on a straight line passing through both centers. Radial lines from $O$ and $O'$ to the circles indicate the radii $R$ and $r$, respectively."
    },
    {
        "index": 1666,
        "question": "如力图 7.22 .1 所示，圆盘在水平面内以匀角速 $\\\\Omega$ 绕固直轴 $O O^{\\prime}$ 旋转，盘上固连着两根同样高度的固直支架。质量为 $m$ 的小球与质量可忽略不计的 T 字形细杆相连，水平杆由支架支承，与小球相连的杆长为 $l$ ，悬点 $O^{\\prime}$ 在转轴上，整个系统可在支架上无摩擦地摆动。试求： 小球的平衡位置；",
        "subject": "CM",
        "image_path": [
            "images/1666_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA pendulum of mass $m$ is suspended from point $O'$ by a string of length $l$ and displaced at an angle $\\theta$ from the vertical, as shown. The support undergoes uniform rotation about a vertical axis passing through point $O$ with angular velocity $\\Omega$, indicated by a curved arrow. All labeled points ($O$, $O'$, $m$) and variables ($l$, $\\theta$, $\\Omega$) are shown in the diagram."
    },
    {
        "index": 1675,
        "question": "一带阀门的圆柱形容器，底面积是 $300 \\mathrm{~cm}^{2}$ ，装有 13 cm 深的水，正方体 A 边长为 12 cm ，重 25 N ，用细绳悬挂放入水中，有 $\\frac{1}{6}$ 的体积露出水面，如图所示。\n\n试求：\n\n若细绳所能承受的最大拉力是 14.92 N ，通过阀门K缓慢放水，当绳子刚要被拉断的瞬间，容器中液面下降的高度。（取 $\\mathrm{g}=10 \\mathrm{~N} / \\mathrm{kg})$",
        "subject": "CM",
        "image_path": [
            "images/1675_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 1,
        "sig_figs": "1",
        "caption": "IMAGE 1:\nA container filled with liquid contains a cuboid labeled $A$ suspended from above, partially or fully submerged. The liquid surface is depicted with horizontal dashed lines, and the container is electrically connected to ground via a switch labeled $K$ on its side."
    },
    {
        "index": 1688,
        "question": "高 6 m ，直径 4 m 的水箱固定在对称安放的四个斜柱上，水箱底面高出支座平面 17 m ，整个水塔重 80 kN ，风压力按水箱垂直风向的平面投影面积计算，风的压强取为 1.25 kPa ，求柱基之间应有的距离 $A B$ ．",
        "subject": "CM",
        "image_path": [
            "images/1688_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 6,
        "sig_figs": "",
        "caption": "IMAGE 1:\nThe diagram shows a water tank of height $6\\,\\text{m}$ and diameter $4\\,\\text{m}$ elevated on a supporting truss structure. The truss legs are anchored to the ground at points $A$ and $B$, each at a vertical distance of $17\\,\\text{m}$ below the base of the tank. All dimensions and key points ($A$, $B$) are labeled, and the tank is positioned centrally above the supports. No forces or vectors are depicted."
    },
    {
        "index": 1704,
        "question": "Fig. 8.1 shows a source $E$ of e.m.f. 60 V in a circuit.\n\nThe heater H has a resistance of $22.5 \\Omega$ and the potential difference (p.d.) across it is 45 V . Calculate:\nthe power of the heater",
        "subject": "EM",
        "image_path": [
            "images/1704_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 1,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nSchematic of an electric circuit showing a closed switch E, a parallel combination of a $10\\,\\Omega$ resistor and an unknown resistor $X$, connected in series with a resistor $H$."
    },
    {
        "index": 1709,
        "question": "如力图 7.13.1 所示，质量为 $M$ 的物体放置在两个完全相同的质量均为 $m$ 的薄壁中空圆筒上，物体两侧系着两个完全相同的劲度系数均为 $k$ 的弹簧，两弹簧的另一端固定，开始时两弹簧均为原长，设物体在两薄圆筒上做纯滚动，试求振动圆频率，",
        "subject": "CM",
        "image_path": [
            "images/1709_0.png"
        ],
        "img_category": "spring_force",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA block of mass $M$ is mounted on two wheels, each of mass $m$, which rest on a horizontal surface. The block is attached to each wall by identical springs, each with force constant $k$. The system’s center is at point $O$, and the $x$-axis points horizontally to the right as indicated by the arrow."
    },
    {
        "index": 1711,
        "question": "如热图 3.19.1 所示，在温度为 $1000{ }^{\\text{°} \\text{C}}$ 的真空加热室中蒸发产生的钨原子 （原子量为 9）气体经小孔逸出，透过准直窄缝形成原子束后，进入长度为 1 m 的真空大容器中，容器的右壁与原子束垂直。原子束中的原子进入真空容器后，将与残存的稀薄空气分子发生碰撞，设原子束行进 1 m 后，其强度（单位时间内通过的原子数）减小为原来的 $1 / \\text{e}$ 。已知真空容器的温度为 300 K ，钨原子与空气分子的碰撞截面为 $10^{-20} \\text{~m}^{2}$ ，忽略钨原子之间的碰撞，试问：真空容器中残存空气的压强是多少？",
        "subject": "TSM",
        "image_path": [
            "images/1711_0.png"
        ],
        "img_category": "thermodynamics",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA source at $1000\\,^\\circ\\mathrm{C}$ is connected via a collimating slit (labeled \"准直狭缝\") to a vacuum chamber (\"真空容器\") of size $1\\,\\mathrm{m}$, maintained at $300\\,\\mathrm{K}$; an atomic beam (\"原子束\") enters the chamber as indicated by a rightward arrow."
    },
    {
        "index": 1722,
        "question": "A trolley rests on a bench. Two identical stretched springs are attached to the trolley as shown in Fig. 4.1. The other end of each spring is attached to a fixed support. The unstretched length of each spring is 12.0 cm. The spring constant of each spring is $8.0 \\mathrm{Nm}^{-1}$. When the trolley is in equilibrium the length of each spring is 18.0 cm. The trolley is displaced 4.8 cm to one side and then released. Assume that resistive forces on the trolley are negligible. The mass of the trolley is 250 g. The maximum acceleration of the trolley is 3.1 \\mathrm{ms}^2. Determine the period $T$ of the subsequent oscillation.",
        "subject": "CM",
        "image_path": [
            "images/1722_0.png"
        ],
        "img_category": "spring_force",
        "vision_relevance": "optional",
        "language": "English",
        "level": 2,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA trolley is positioned horizontally on a bench and connected at both ends to two springs, each attached to a fixed support; the left spring is compressed by 18.0 cm. All components are labeled: \"trolley,\" \"bench,\" \"spring,\" and \"support.\" No vector arrows or additional forces are depicted."
    },
    {
        "index": 1726,
        "question": "As shown in Fig. 2.32, an infinite wire carries a current $I$ in the $+z$ direction. A rectangular loop of wire of side $l$ is connected to a voltmeter and moves with velocity $\\mathbf{u}$ radially away from the wire. Indicate which terminal ( $a$ or $b$ ) of the voltmeter is positive.",
        "subject": "EM",
        "image_path": [
            "images/1726_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "optional",
        "language": "English",
        "level": 7,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA square conducting loop of side length $l$ is oriented in the $xy$-plane, with one side parallel to the $y$-axis, and its corners positioned such that one vertex is at distance $r_1$ from the origin along the $x$-axis and the opposite vertex is at $r_2$ along the same axis. The loop moves with constant velocity $\\vec{u}$ in the positive $x$-direction. A voltmeter $V$ is connected between points $a$ (upper right corner) and $b$ (lower right corner) of the loop. The $x$- and $z$-axes are labeled and indicated, and points $a$ and $b$ are specifically marked."
    },
    {
        "index": 1729,
        "question": "如图示所示，转台绕中心竖直轴以角速度 $\\omega_{0}$ 作匀速转动。转台对该轴的转动惯量 $J=5 \\times 10^{-5} \\mathrm{~kg} \\cdot \\mathrm{~m}^{2}$ 。现有砂粒以 $1 \\mathrm{~g} / \\mathrm{s}$ 的速度落到转台，并粘在台面形成一半径 $r=0.1 \\mathrm{~m}$ 的圆。试求砂粒落到转台，使转台角速度变为 $\\omega_{0} / 2$ 所花的时间。",
        "subject": "CM",
        "image_path": [
            "images/1729_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "1",
        "caption": "IMAGE 1:\nA solid disk rotates counterclockwise about a vertical axis passing through its center. A funnel containing particles is positioned near the disk's edge with its spout aligned to release particles onto the disk's surface. The dashed arrows indicate the radius $r$ and the rotational motion."
    },
    {
        "index": 1737,
        "question": "如图所示，有一无限大通有电流的扁平铜片，宽度为 $a$ ，厚度不计，电流 $I$ 在铜片上均匀分布，在铜片外与铜片共面，离铜片左边缘为 $b$处的 $P$ 点的磁感强度的大小为（）。",
        "subject": "EM",
        "image_path": [
            "images/1737_0.png"
        ],
        "img_category": "capacitance_resistance",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA straight, current-carrying wire segment of length $a$ carries current $I$ upward through a plane, then continues horizontally to the right for length $b$ towards point $P$; the point $P$ is positioned along the extension of the horizontal segment. Arrow directions indicate current $I$ is upward through the plane and left-to-right along the horizontal."
    },
    {
        "index": 1752,
        "question": "Two circular loops of resistive wire are placed next to each other as in the figure. The circular loop on the left is connected to a constant voltage source $V$. The resistance of this loop is increasing linearly with time. As the resistance is changing, what is the orientation of the conventional current in the right-hand loop (as viewed in the figure from above)?",
        "subject": "EM",
        "image_path": [
            "images/1752_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "optional",
        "language": "English",
        "level": 3,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo identical conducting spheres are shown side by side. A battery of voltage $V$ is connected to the left sphere, which contains a labeled point $P$ at its center. No connections are shown to the right sphere."
    },
    {
        "index": 1753,
        "question": "如图所示，半径为 $R$ ，质量为 $m$ 的匀质细圆环上均匀地分布着相对圆环固定不动的正电荷，总电量为 $Q$ 。 $t=0$ 时，圆环在水平地面上具有沿正东方向的平动速度 $v_{0}$ ，且无滚动。假设圆环与地面之间的摩擦系数为 $\nu$ ，在圆环周围只有沿水平方向北方（图中垂直图平面朝里为北方）的匀强地磁场 $B$ 。 为了使圆环在而后的运动过程中始终不会离开地面，试求 $v_{0}$ 的取值范围。",
        "subject": "EM",
        "image_path": [
            "images/1753_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA uniformly charged solid disk of mass $m$, charge $Q$, and radius $R$ (center $O$) initially moves eastward with velocity $v_0$ on a horizontal surface with coefficient of friction $\\mu$; a uniform magnetic field $\\vec{B}$ is directed into the page, as indicated by crosses."
    },
    {
        "index": 1763,
        "question": "The diagram (Fig. 2.22) shows a double-slit experiment in which coherent monochromatic light of wavelength $\\lambda$ from a distant source is incident upon the two slits, each of width $w(w \\gg)$, and the interference pattern is viewed on a distant screen. A thin piece of glass of thickness $\\delta$, index of refraction $n$, is placed between one of the slits and the screen perpendicular to the light path, and the intensity at the central point $P$ is required as a function of thickness $\\delta$. Assume that the glass does not absorb or reflect any light. If the intensity for $\\delta=0$ is given by $I_{0}$: Suppose the width $w$ of one of the slits is now increased to $2 w$, the other width remaining unchanged. What is the intensity at point $P$ as a function of $\\delta$ ?",
        "subject": "OPT",
        "image_path": [
            "images/1763_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "optional",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA source slit (tilted rectangle) is shown displaced by a distance $\\delta$ parallel to itself with respect to its original position; straight lines represent light rays emitted from the ends and center of the slit, converging at point $P$ on a distant screen."
    },
    {
        "index": 1777,
        "question": "A pendulum of mass $m$ and length $l$ is released from rest in a horizontal position. A nail a distance $d$ below the pivot causes the mass to move along the path indicated by the dotted line. Find the minimum distance $d$ in terms of $l$ such that the mass will swing completely round in the circle shown in Fig. 1.8.",
        "subject": "CM",
        "image_path": [
            "images/1777_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "optional",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA mass $m$ is attached to one end of a rigid rod of length $l$; the opposite end is fixed. A dotted arc indicates the possible path of $m$, and a dashed circle of diameter $d$ is drawn tangent to the rod, centered directly below the fixed end."
    },
    {
        "index": 1791,
        "question": "半径 $R$ 为 30 cm 的轮子，装在一根长为 $l=40 \\mathrm{~cm}$ 的轴的中部，并可绕其转动，轮和轴的质量共 5 kg ，系统的回转半径为 25 cm ，轴的一端 $A$ 用一根链条挂起，如果原来轴在水平位置，并使轮子以 $\\omega_{\\text {白}}=12 \\mathrm{rad} / \\mathrm{s}$ 的角速度旋转，方向如图所示，求：轴上的外力矩。",
        "subject": "CM",
        "image_path": [
            "images/1791_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA rigid rod $AB$ of length $l$ is attached at point $A$ to a wall and connected at point $O$ to a wheel or disk of radius $R$, which rotates about a horizontal axis through $O$ as indicated by the curved arrow; point $O$ is also the center of the disk."
    },
    {
        "index": 1796,
        "question": "如习题 8－20图所示，半径为 $R$ ，电荷线密度为 $\\lambda(\\lambda>0)$ 的均匀带电圆环，绕圆心且与圆平面垂直的轴以角速度 $\\omega$ 转动，求：轴线上距圆心为 $a$ 处的一点的磁感应强度 $\\boldsymbol{B}$ 的大小。",
        "subject": "EM",
        "image_path": [
            "images/1796_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nSchematic of an electrical circuit containing two batteries with emfs $\\varepsilon_1,\\ \\varepsilon_2$ and internal resistances $R_{i1},\\ R_{i2}$, four resistors $R_1$, $R_2$ (connected in parallel between nodes $A$ and $B$), $R_3$, $R_4$ (each connected in series at different sections), and labeled nodes $A$, $B$, $C$, $D$; all components are connected in a single closed loop."
    },
    {
        "index": 1807,
        "question": "A second long, straight wire $Q$, carrying a current of 5.0 A out of the page, is placed parallel to wire $P$, as shown in Fig. 6.2. (ii) State the direction of the force exerted on wire $Q$ by wire $P$.",
        "subject": "EM",
        "image_path": [
            "images/1807_0.png",
            "images/1807_1.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "optional",
        "language": "English",
        "level": 2,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA straight wire labeled “wire P” is shown oriented diagonally, with an $\\otimes$ symbol at one end indicating electric current is directed into the page at that position. No other physical objects or vectors are depicted."
    },
    {
        "index": 1810,
        "question": "如图所示，一根质量为 $m$ ，长度为 $L$ 的匀质细直棒，平放在水平桌面上。若它与桌面间的滑动摩擦系数为 $\\nu$ ，在 $t=0$ 时，使该棒绕过其一端的坚直轴在水平桌面上旋转，其初始角速度为 $\\nu_{0}$ ，则棒停止转动所需时间为 $\\boxed{\\text{?}}$",
        "subject": "CM",
        "image_path": [
            "images/1810_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA uniform rod of length $L$ extends from point $o$ to $L$; at a distance $r$ from $o$, an infinitesimal segment of width $dr$ and mass $dm$ is highlighted."
    },
    {
        "index": 1822,
        "question": "一个不带电的空腔导体球壳，内半径为 $R$ 。在腔内离球心的距离为 $a$ 处放一点电荷 $+q$ ，如图所示。用导线把球壳接地后，再把地线撤去。选无穷远处为电势零点，则球心 $O$处的电势为（ ）。",
        "subject": "EM",
        "image_path": [
            "images/1822_0.png"
        ],
        "img_category": "charge_distribution",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA point charge $+q$ is located at a distance $a$ from the center $O$ inside a hollow conducting spherical shell of inner radius $R$; the shell is shaded and centered at $O$, and vector $\\vec{a}$ indicates the position of the charge relative to $O$."
    },
    {
        "index": 1824,
        "question": "A capacitor is made of two plane parallel plates of width $a$ and length $b$ separated by a distance $d$ ($d \\ll a, b$), as in Fig. 1.23. The capacitor has a dielectric slab of relative dielectric constant $K$ between the two plates. The capacitor is connected to a battery of emf $V$. The dielectric slab is partially pulled out of the plates such that only a length $x$ remains between the plates. Calculate the force on the dielectric slab which tends to pull it back into the plates. Neglect edge effects in both parts.",
        "subject": "EM",
        "image_path": [
            "images/1824_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "optional",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA rectangle of total width $b$ and height $d$ is shown, with its left section of width $x$ shaded. All dimensions are indicated by labeled arrows: $d$ (vertical height), $x$ (horizontal width of shaded region), and $b$ (overall horizontal width). No vectors or forces are depicted."
    },
    {
        "index": 1842,
        "question": "如力图 7.20.1 所示，单摆的原长为 $l_{0}$ ，在摆动过程中缓慢上拉，悬点位置不变而摆长逐渐缩短。试求当摆长缩短为原长之半，即 $l=l_{0} / 2$ 时的振幅与原振幅之比。",
        "subject": "CM",
        "image_path": [
            "images/1842_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA schematic diagram showing a vertical column of liquid with surface at point $O$; the liquid has density $\\rho_0$ at the surface, increasing to $2\\rho_0$ at depth $D$, and $\\rho_0$ at depth $D/2$. A particle is submerged at depth $D$, experiencing two vertical forces: the downward gravitational force $mg$ (vector pointing downward) and the upward buoyant force $\\rho V g$ (vector pointing upward). The $x$ axis is directed vertically downward from the surface."
    },
    {
        "index": 1864,
        "question": "Determine width $\\Delta r$ of the second Fresnel zone at plane $x, y$, separated by distance $a=1.5 \\mathrm{~m}$ from light source S, for observation point P located on the optical axis at distance $b=1 \\mathrm{~m}$ from the plane $x, y$. The wavelength of the light is $\\lambda_{0}=600 \\mathrm{~nm}$. ",
        "subject": "OPT",
        "image_path": [
            "images/1864_0.png"
        ],
        "img_category": "optical_path",
        "vision_relevance": "optional",
        "language": "English",
        "level": 6,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA schematic showing multiple trajectories (arrows) from point $S$ to point $P$ along the $z$-axis, with horizontal coordinates labeled $S$, $P$, and distances $a$ (from $S$ to the origin) and $b$ (from the origin to $P$); axes $x$, $y$, and $z$ are indicated with $z$ as the horizontal and $x, y$ perpendicular, and all arrows point from $S$ to $P$."
    },
    {
        "index": 1898,
        "question": "如图所示， M 是放在水平桌面上的物体，两边用细线通过滑轮与吊盘相连，若在左盘中放重为G的砝码，右盘中放重为 $2 G$的砝码时，物体M恰好以速度 $v$ 向右做匀速直线运动；如果右盘中的砝码不变，物体 M 在水平桌面上以速度 2 v 向左做匀速直线运动，则左盘中砝码的重应为多少？（吊盘重不计，绳子与滑轮摩擦不计）",
        "subject": "CM",
        "image_path": [
            "images/1898_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 1,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA horizontal block of mass $M$ rests on a table and is attached to two cords passing horizontally in opposite directions over frictionless pulleys at either side; each cord connects to a hanging mass. The arrangement shows the mass $M$ centered between the pulleys, with both hanging masses suspended vertically downward. The cords are taut, passing over the pulleys, connecting the system. No specific directions for forces or motion are indicated in the diagram."
    },
    {
        "index": 1902,
        "question": "A particle of mass $m$ can slide without friction on the inside of a small tube bent in the form of a circle of radius $a$. The tube rotates about a vertical diameter at a constant rate of $\\omega\\,\\mathrm{rad}/\\mathrm{sec}$ as shown in Fig. 1.79. If the particle is disturbed slightly from its unstable equilibrium position at $\\theta=0$, find the position of maximum kinetic energy. (SUNY, Buffalo)",
        "subject": "CM",
        "image_path": [
            "images/1902_0.png"
        ],
        "img_category": "circular_motion",
        "vision_relevance": "optional",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA small object of mass $m$ is inside a fixed vertical circular ring of radius $a$; the ring rotates about its vertical diameter with angular velocity $\\omega$. The object is at an angle $\\theta$ from the lowest point. Forces $\\vec{N}$ (normal, radial and upward-right) and $mg$ (weight, vertically downward) act on the mass. Gravity acts downward ($g$ arrow), and the system is supported at the base."
    },
    {
        "index": 1908,
        "question": "如图所示，置于地面和塔顶的两架弹射器，以相同的速率 $v_{0}$ 沿它们的连线同时弹射出两球。如果塔顶高 $h=10\\,\\mathrm{m}$ ，两弹射器相隔的水平距离 $s=20\\,\\mathrm{m}$ ，要使两球在空中相碰，$v_{0}$ 至少应等于多少？",
        "subject": "CM",
        "image_path": [
            "images/1908_0.png"
        ],
        "img_category": "linear_motion",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "4",
        "caption": "IMAGE 1:\nA particle is projected from ground level with initial speed $v_0$ at angle $\\theta$ above the horizontal; its initial velocity vector $\\vec{v}_0$ is directed upward and to the right. The particle travels a horizontal distance $s$ to reach a vertical wall of height $h$, where its velocity (also labeled $v_0$) is shown tangent to its path, moving upward and rightward. All key variables and trajectory segments are indicated."
    },
    {
        "index": 1913,
        "question": "A U-shaped tube contains some liquid. The liquid column in each half of the tube has length $L$, as shown in Fig. 3.1. The liquid columns are displaced vertically. The liquid then oscillates in the tube. The liquid levels are displaced from the equilibrium positions as shown in Fig. 3.2. The acceleration $a$ of the liquid in the tube is related to the displacement $x$ by the expression $a=-\\left(\\frac{g}{L}\\right)x$, where $g$ is the acceleration of free fall. The oscillations of the liquid in the tube are damped. In any one complete cycle of the oscillations, the amplitude decreases by $6.0\\%$ of its value at the beginning of the oscillation. Determine the ratio energy of oscillations after 3 cycles to initial energy of oscillations.",
        "subject": "CM",
        "image_path": [
            "images/1913_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "optional",
        "language": "English",
        "level": 2,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nTwo U-shaped tubes containing liquid (gray region) are shown:\n\n- In Fig. 3.1, the heights of the liquid columns on both arms are indicated as $L$ from the lowest point of the curve.\n- In Fig. 3.2, the liquid levels in the two arms are displaced, with the differences in height labeled $x$ for each side, showing one arm’s liquid surface is above and the other is below a reference level.\n\nBoth diagrams show only the static arrangement of a liquid in a symmetric U-tube, with $L$ and $x$ denoting measured vertical distances. No vector quantities are explicitly depicted."
    },
    {
        "index": 1928,
        "question": "地球质量 $M=5.98 \\times 10^{24} \\text{kg}$ ，月球质量 $m=7.3 \\times 10^{22} \\text{kg}$ ，月球中心与地球中心相距 $r_{0}=3.84 \\times 10^{8} \\text{m}$ ，万有引力常量 $G=6.67 \\times 10^{-11} \\text{m}^{3} /(\\text{kg} \\times \\text{s}^{2})$ 。 只考虑地球和月球之间的万有引力，试求月球中心绕地-月系统质心作圆周运动的周期（这也是月球中心绕地球中心作圆周运动的周期）$T_{0}$（以“天”（符号：d）为单位）。",
        "subject": "CM",
        "image_path": [
            "images/1928_0.png"
        ],
        "img_category": "astrophysics",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nThe diagram shows the Sun (太阳), Earth (地球), and Moon (月球) aligned along a straight line, with the Earth and Moon to the right of the Sun; point $C$ marks the center of mass of the Earth-Moon system (地-月系統质心), and an upward-pointing arrow at $C$ indicates a vector in the positive vertical direction."
    },
    {
        "index": 1958,
        "question": "有一同轴电缆，其尺寸如图所示。两导体中的电流均为 $I$ ，但电流的流向相反，导体的磁性可不考虑。试计算以下各处的磁感应强度：(1) $r<R_{1}$ ；",
        "subject": "EM",
        "image_path": [
            "images/1958_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA long cylindrical object is shown in cross-section with three concentric regions, each labeled by its respective radius: $R_1$ (inner radius), $R_2$ (middle radius), and $R_3$ (outer radius). Each radius vector extends from the cylinder’s axis outward corresponding to their regions. No external forces, fields, or currents are depicted."
    },
    {
        "index": 1963,
        "question": "A cylindrical container is initially separated by a clamped piston into two compartments of equal volume. The left compartment is filled with one mole of neon gas at a pressure of 4 atmospheres and the right with argon gas at one atmosphere. The gases may be considered as ideal. The whole system is initially at temperature $T=300 \\mathrm{~K}$, and is thermally insulated from the outside world. The heat capacity of the cylinder-piston system is $C$ (a constant). The piston is now unclamped and released to move freely without friction. Eventually, due to slight dissipation, it comes to rest in an equilibrium position. Calculate: The new temperature of the system (the piston is thermally conductive).",
        "subject": "TSM",
        "image_path": [
            "images/1963_0.png"
        ],
        "img_category": "thermodynamics",
        "vision_relevance": "optional",
        "language": "English",
        "level": 8,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA horizontal cylinder is divided into two compartments by a movable piston; the left compartment contains neon gas labeled \"neon,\" and the right compartment contains argon gas labeled \"argon.\" The piston separates and contacts both gases along the vertical interface. No vector quantities are depicted."
    },
    {
        "index": 1966,
        "question": "如图所示，光滑水平面上有一半径为 $R$ 的固定圆环，长 $2 l$ 的匀质细杆 $A B$ 开始时在水平面上绕着中心 $C$ 点旋转，$C$ 点靠在杆上，且无初速度。假设细杆而后可无相对滑动地绕着圆环外侧运动，直到细杆的 $B$ 端与环接触后彼此分离，已知细杆与圆环间的摩擦系数 $\\mu$ 处处相同，试求 $\\mu$ 的取值范围，",
        "subject": "CM",
        "image_path": [
            "images/1966_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA uniform bar $AB$ of length $2l$ is horizontally supported on a cylindrical fulcrum at point $C$ (the midpoint); forces are applied upward at $A$ and downward at $B$ (both indicated by arrows), and the fulcrum exerts an upward normal force on the bar at $C$."
    },
    {
        "index": 1969,
        "question": "The switch $S$ in the RC circuit shown is closed at time $t=0$. All circuit elements are ideal and $R=10.0 \\, \\Omega$, $C=2.20 \\, \\mathrm{F}$, and $\\xi=12.0 \\, \\mathrm{V}$. The capacitor is initially uncharged. How long after the switch is closed is the voltage across the capacitor three times as large as the voltage across the resistor?",
        "subject": "CM",
        "image_path": [
            "images/1969_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "optional",
        "language": "English",
        "level": 3,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA series circuit diagram consisting of a battery labeled $\\xi$, a switch labeled $S$, a capacitor labeled $C$, and a resistor labeled $R$, all connected in a single closed loop."
    },
    {
        "index": 1974,
        "question": "在半径为 $R$ 的金属球之外包有一层均匀电介质层（如习题 7－62 所示），外半径为 $R'$。设电介质的相对电容率为 $\\varepsilon_{r}$，金属球的电荷量为 $Q$，求电介质层外的电势分布。",
        "subject": "EM",
        "image_path": [
            "images/1974_0.png"
        ],
        "img_category": "capacitance_resistance",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA cross-sectional diagram showing a uniformly charged circular disk (shaded region) of radius $R$ with positive charge distributed throughout, centered within a larger concentric circle. Two radial lines mark a sector with central angle labeled (not specified). A smaller radius $R'$ is marked from the center to a point inside the disk; the outer disk boundary is at radius $R$."
    },
    {
        "index": 612,
        "question": "如热图1.16.1所示，竖直石英管内有：\n\n下方空气柱长度$2l_0$，上方可分解双原子分子气体长度$l_0$。气体分解规律满足$\\frac{\\Delta n}{n_0}=\\frac{\\Delta T}{T_0}$（$\\Delta T\\ll T_0$）。初始水银柱压强为$\\alpha$倍空气压强（$0<\\alpha<1$）。当温度$T$从$T_0$稍增加时，试判断水银柱运动方向（上升/下降）。",
        "subject": "TSM",
        "image_path": [
            "images/612_0.png"
        ],
        "img_category": "thermodynamics",
        "vision_relevance": "optional",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA vertical tube contains a mercury column (水银柱) positioned between an upper gas chamber of height $l_0$ (气体) and a lower air chamber of height $2l_0$ (空气). All sections are labeled with their respective heights. No additional vectors or forces are depicted."
    },
    {
        "index": 1375,
        "question": "静长同为 $t_{0}$ 的三个飞船，在惯性系 $S$ 的 $t=0$ 时刻，相对 $S$ 系的空间位置和沿 $x$ 轴匀速运动的速度分布如图所示。具体而言，三个飞船在 $S$ 系中沿一直线航行，$t=0$ 时刻，飞船 1，2，3 头部分别位于图示 $P_{1}, P_{2}, P_{3}$ 位置，飞船 $1, ~ 2, ~ 3$ 分别将自己头部时钟拨到本系内的时间零点。（注意；$S$ 系认为飞船 $1, ~ 2, ~ 3$ 头部时钟同时拨到零点，但飞船 $1, ~ 2$ ， 3 并不认为它们彼此也是同时将各自头部时钟拨到零点。）设此时，即 $S$ 系 $t=0$ 时刻，飞船 1 头部天线朝右发出无线电信号；在飞船 2 参考系中此信号被其尾部天线接收的同时，恰好其头部天线朝右发出无线电信号；在飞船 3 参考系中此信号被其尾部天线接收的同时，恰好其头部高位天线朝左对着飞船 1 尾部高位天线发出无线电信号。将飞船 3 测得的其尾部天线接收到无线电信号的时刻记为 $t_{3}^{\\text{prime}}$ ，试求飞船3参考系测得的其尾部天线接收到无线电信号的时刻 $t‘_{3\\text{尾}}$.",
        "subject": "CM",
        "image_path": [
            "images/1375_0.png"
        ],
        "img_category": "relativity_gravity",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nThree identical rods labeled 1, 2, and 3 (each of proper length $\\ell_0$) are aligned along the $x$-axis with their left ends at positions $P_1$, $P_2$, and $P_3$, respectively, all moving to the right with velocities $v_1 = \\frac{2}{5}c$, $v_2 = \\frac{3}{5}c$, and $v_3 = \\frac{4}{5}c$ (indicated by rightward arrows), where the distance between $P_1$ and $P_2$ and between $P_2$ and $P_3$ is $L$; all quantities are referenced to the inertial frame $S$."
    },
    {
        "index": 1601,
        "question": "两根均质杆 $A B$ 和 $A C$ 都以 $A$ 端搁在光滑水平地板上，且彼此以光滑的铅垂端面相接触．两杆的 $B$ 端和 $C$ 端分别依靠在两个光滑的铅垂墙上．设两杆之间夹角为 $90^{\\circ}$ ，问：两墙之间的距离应为多少才能使这两杆平衡？已知长度 $A B=a, A C=b$ ，又杆 $A B$ 的重量为 $P_{1}$ ，杆 $A C$ 的重量为 $P_{2}$ ．",
        "subject": "CM",
        "image_path": [
            "images/1601_0.png"
        ],
        "img_category": "static_force_analysis",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 6,
        "sig_figs": "",
        "caption": "IMAGE 1:\nDiagram of a trough with rough vertical and horizontal walls, containing two smooth rods, $AB$ and $AC$, joined at point $A$; rod $AB$ touches the left wall at $B$ and the floor at $D$, while rod $AC$ touches the right wall at $C$ and the floor at $E$, forming a symmetric arrangement with all points ($A$, $B$, $C$, $D$, $E$) labeled."
    },
    {
        "index": 582,
        "question": "由长为 $l$ 的轻杆与半径为 $r$ 的匀质圆盘组成两个摆，其中另一个摆的圆盘装在杆端的光滑转轴上，可相对地自由转动如图（b）所示；当摆作微小振动时，试求该摆的周期。",
        "subject": "CM",
        "image_path": [
            "images/582_0.png"
        ],
        "img_category": "simple_harmonic_motion",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo identical physical pendulums are shown, each consisting of a massless rod of length $l$ pivoted at point $O$ and attached to a solid disk of radius $r$ at the lower end; in (a) the disk's center $G$ is not aligned with the rod, while in (b) $G$ lies along the rod’s extension; both rods are inclined at equal angles from the vertical."
    },
    {
        "index": 1369,
        "question": "In an inertial frame, a square with diagonal length $2 l_{0}$ has four point charges of the same charge $q>0$ at its vertices and a stationary point charge of $-Q<0$ at its center. As shown in Figure 1, assuming no external forces, each point charge is in force equilibrium. Find $Q$.",
        "subject": "EM",
        "image_path": [
            "images/1369_0.png",
            "images/1369_1.png",
            "images/1369_2.png",
            "images/1369_3.png"
        ],
        "img_category": "relativity_gravity",
        "vision_relevance": "essential",
        "language": "English",
        "level": 4,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA square configuration with four point charges $q$ placed at each vertex, with dashed lines indicating the center-to-vertex distance labeled $l_0$; a charge $-Q$ is located at the geometric center, with all four $l_0$ vectors pointing from the central charge to each corner charge."
    },
    {
        "index": 1751,
        "question": "Each of the two curved rods shown in the picture form one-quarter of a circle with a radius $R$. Both rods carry a uniformly distributed electric charge $+Q$. What is the net electric potential at the origin?",
        "subject": "EM",
        "image_path": [
            "images/1751_0.png"
        ],
        "img_category": "charge_distribution",
        "vision_relevance": "optional",
        "language": "English",
        "level": 3,
        "sig_figs": "",
        "caption": "IMAGE 1:\nTwo quarter-circular arcs, each of radius $R$ and carrying charge $+Q$, are centered at point $O$ on the $xy$ plane; one arc lies in the first quadrant and the other in the third quadrant, both subtending $90^\\circ$ about $O$ with their endpoints on the $x$- and $y$-axes as shown."
    },
    {
        "index": 1703,
        "question": "A ruby laser emits light with a wavelength of $6943 \\AA$, which to a very good approximation is a plane wave. What fraction of each component of polarization of the laser light is reflected as the beam enters the water at $45^{\\circ}$ to the normal to the surface?",
        "subject": "OPT",
        "image_path": [
            "images/1703_0.png"
        ],
        "img_category": "photoelectric_effect",
        "vision_relevance": "essential",
        "language": "English",
        "level": 8,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nEnergy level diagram with three discrete states labeled $E_1$, $E_2$, and $E_3$; downward wavy arrows from $E_3$ to $E_2$ and from $E_2$ to $E_1$ represent electronic transitions between the energy levels, with the $E_2 \\rightarrow E_1$ transition emitting a photon of energy $h\\nu$ (direction indicated by the wavy arrow)."
    },
    {
        "index": 509,
        "question": "Two monochromatic plane waves with wavelengths $\\\\lambda=$ 600 nm linearly polarized in orthogonal directions are incident on the $(x, y)$ plane under different angles with the $x$ axis, $\\\\alpha_{01}=0$ deg and $\\\\alpha_{02}=30$ deg. Determine the spatial period $\\\\Lambda$ along the $x$ axis for the variation of the polarization state of resulting summary oscillations excited by these waves.",
        "subject": "OPT",
        "image_path": [
            "images/509_0.png"
        ],
        "img_category": "wave_motion",
        "vision_relevance": "essential",
        "language": "English",
        "level": 6,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nDiagram depicting two sets of electric field vectors: $\\vec{E}_1$ oriented vertically downward, and $\\vec{E}_2$ directed at an angle from the $x$-axis, indicated with a circular arrow; the vectors are shown in an $x$-$z$ coordinate system, and the angle between $\\vec{E}_1$ and $\\vec{E}_2$ is labeled as $\\alpha_{02}$ for each set."
    },
    {
        "index": 1640,
        "question": "半径为 $R$ 的平面圆形线圈中载有电流 $I_{2}$ ，另一无限长直导线 $AB$ 中载有电流 $I_{1}$ ，设 $AB$ 通过圆心，并和圆形线圈在同一平面内（如图所示），求圆形线圈所受的磁场力。",
        "subject": "EM",
        "image_path": [
            "images/1640_0.png"
        ],
        "img_category": "electromagnetic_field",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 5,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA circular loop of radius $R$ is shown with a vertical straight wire passing through points $A$ and $B$ at its diameter. The wire carries current $I_1$ upward. The right semicircular arc carries current $I_2$ in a counterclockwise direction (from $A$ to $B$). All currents are depicted with arrowhead vectors indicating their respective directions."
    },
    {
        "index": 1113,
        "question": "如力图 4.5.1 所示，质量为 $m=1.20 \\times 10^{4} \\mathrm{~kg}$ 的飞船在离月球表面高度为 $h=$ 100 km 处绕月球做圆周运动。飞船采用两种登月方式：在 $A$ 点向外侧（即向力图 4.5.1 右方）沿月球半径短时间喷气，使飞船与月球相切地到达月球上的 $C$ 点。设喷气相对飞船的速度为 $u=1.00 \\times 10^{4} \\mathrm{~m} / \\mathrm{s}$ 。已知月球半径 $R=1700 \\mathrm{~km}$ ，月球重力加速度（当作常量）$g=1.700 \\mathrm{~m} / \\mathrm{s}^{2}$ 。试求：两种登月方式各需的燃料质量。",
        "subject": "CM",
        "image_path": [
            "images/1113_0.png"
        ],
        "img_category": "projectile_motion",
        "vision_relevance": "essential",
        "language": "Chinese",
        "level": 4,
        "sig_figs": "3",
        "caption": "IMAGE 1:\nA point $O$ is at the center of two concentric circles. Points $A$ and $B$ lie on the circumference of the inner circle of radius $R$, with point $A$ outside the circles at a distance $h$ from the horizontal through $O$. A curved path $C$ connects $A$ to $B$; straight dashed lines indicate distances $OA$, $OB$, and $AB$."
    },
    {
        "index": 205,
        "question": "The decay $K \\rightarrow \\pi \\gamma$ is absolutely forbidden by a certain conservation law, which is believed to hold exactly. Which conservation law is this?",
        "subject": "AMONP",
        "image_path": [
            "images/205_0.png"
        ],
        "img_category": "atomic_physics",
        "vision_relevance": "optional",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA $\\pi$ beam (indicated by a leftward arrow) enters a shaded rectangular region labeled \"target\"; two arrows emerge from the target, one labeled \"$\\Lambda$\" pointing upwards and right, and another labeled \"other particles\" pointing downwards and right, representing outgoing particles after an interaction in the target."
    },
    {
        "index": 1964,
        "question": "A mass $M$ is constrained to slide without friction on the track $AB$ as shown in Fig. 2.24. A mass $m$ is connected to $M$ by a massless inextensible string. (Make small angle approximation.) Find the normal coordinates (and describe them).",
        "subject": "CM",
        "image_path": [
            "images/1964_0.png"
        ],
        "img_category": "simple_harmonic_motion",
        "vision_relevance": "optional",
        "language": "English",
        "level": 8,
        "sig_figs": "",
        "caption": "IMAGE 1:\nA block of mass $M$ rests on a horizontal frictionless surface between points $A$ and $B$ aligned along the $x$-axis; a pendulum of length $b$ and mass $m$ is attached to the block, forming an angle $\\theta$ with the vertical; $O$ denotes the pendulum's bob; $x$ and $y$ axes are shown with $y$ vertically upward and $x$ horizontally to the right."
    },
    {
        "index": 716,
        "question": "The diagram below shows combinations X, Y, and Z of three identical resistors. What is the correct order of the total resistance of the combinations going from lowest resistance to highest resistance?",
        "subject": "CM",
        "image_path": [
            "images/716_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 3,
        "sig_figs": "",
        "caption": "IMAGE 1:\nFrom left to right: the first diagram shows three resistors in parallel; the second diagram shows two resistors in parallel followed by a third resistor in series with the combination; the third diagram shows three resistors arranged in a combination of two parallel branches, each containing at least one resistor. No component values, labels, or direction indicators are provided."
    },
    {
        "index": 1644,
        "question": "A circuit contains two fixed resistors and a light-dependent resistor (LDR). Fig. 8.1 shows that the power supply is a 9.0 V battery.\n\nThe current in the $450 \\Omega$ resistor is 0.012 A .\n\nCalculate the power dissipated in the $800 \\Omega$ resistor.",
        "subject": "EM",
        "image_path": [
            "images/1644_0.png"
        ],
        "img_category": "circuit_diagram",
        "vision_relevance": "essential",
        "language": "English",
        "level": 1,
        "sig_figs": "2",
        "caption": "IMAGE 1:\nA circuit diagram featuring a $9.0\\ \\mathrm{V}$ battery connected in series with an $800\\ \\Omega$ resistor, then splitting into two parallel branches: one containing a $450\\ \\Omega$ resistor and the other containing a component labeled with a lamp symbol."
    }
]